[{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Full Time Mechanics - Kensington - Immediate Start - Up To £800/week",
  "location": "Ladbroke Grove, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "600 - 800 Per Week",
  "Recruiter": "Jacks Garage",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "Description": "This is an excellent opportunity for an experienced technician, who wants to work in a friendly and enjoyable environment.  We are Jacks Garage (www.jacksgarage.co.uk) London’s premier VW specialists at W10 6SW. A few minutes walk from two underground stations and just of the A40 (Shephards bush) if you drive into work. Official opening hours are 8-6, however some of the lads do extra time from 7-7.  We are recruiting mechanics, panel beaters and all workshop staff with generic skills, focusing mainly on mechanical experience (vehicle maintenance) and body shop panel beaters (welding & metal fabrication).  You must be able to speak, read and write English, does not need to be excellent..  You will have a minimum of 4 years experience in your area of expertise..  This is a very pleasant place to work, everyone is friendly and helpful.  Starting salary depends on experience and skills.  If you have any questions, feel free to call or drop us a line.",
  "Ad_id": "5411991594",
  "search_keywords": {
    "title": "Full Time Mechanics - Kensington - Immediate Start - Up To £800/week",
    "location": "Ladbroke Grove, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "URGENT Plumber Needed",
  "location": "Central London, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "13 days ago",
  "Salary": "£45,500 - 48,000 / £190 - £200 Per Day / All Expenses Paid",
  "Closes": "09 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "JOB TITLE: URGENT Plumber Needed  LOCATION: SW4 6DH, London, United Kingdom  TERMS: Self-employed  SALARY: £45,500 - 48,000 / £190 - £200 Per Day / All Expenses Paid  BENEFITS:  Parking & Petrol Paid For  Company Card For Materials  Brand New Van  Career Progression  Recognition For Excellence  Join a Growing Business  ABOUT US:  Optimal Maintenance Ltd offers property maintenance to a variety of clients from property management companies to high-end estate agents.  Optimal Maintenance Ltd offers a professional service covering all types of property maintenance. This could be a carpenter to fit a new door lock, a gas-safe plumber to install a new boiler , or a full property refurbishment. No job is too small and, as a result, this means properties receive the care they deserve with a high level of customer service from both office and field staff.  Job Summary:  Our plumbing and heating division is seeking an experienced Plumber and Gas Safe Engineer to join our team. The ideal candidate will be responsible for installing, maintaining, and repairing plumbing and heating systems in residential and commercial properties. The Plumber and Gas Safe Engineer will also be responsible for ensuring that all work is completed in a timely and efficient manner and that all safety standards are met.  Key Responsibilities:  Install and maintain plumbing and heating systems in residential and commercial properties.  Install and maintain gas appliances and systems in accordance with Gas Safe regulations.  Identify and repair leaks in plumbing and heating systems.  Diagnose and repair faults in gas appliances and systems.  Test and maintain gas appliances and systems to ensure they are safe and in good working order.  Follow all safety protocols and guidelines to ensure a safe work environment.  Keep accurate records of work performed, time spent, and materials used.  Travel between jobs in and around London  Update jobs via app portal ensuring reports are written thoroughly and good quality before and after pictures are taken  Where jobs are to be quoted for to provide a report and links with the materials needed, and time needed to carry out the further repairs along with a description of the issue and the timing needed to rectify the issue  Working hours will be either be 8am-5pm or 9am-6pm  Thorough knowledge of local DIY stores in London  THE IDEAL CANDIDATE SHOULD HAVE:  Must have their own tools  Clean valid UK driving license and must be over 25 years old due to insurance  Trustworthy with excellent quality workmanship  Ability to diagnose and carry out repairs whilst on site including the ability to source materials required  Good verbal and written communication skills  For more information, please visit our website at www.theoptimalgroup.co.uk or send an email to recruitment@theoptimalgroup.co.uk or call us on 0208 004 4442  Please send your C.V to recruitment@theoptimalgroup.co.uk Immediate start",
  "Ad_id": "5411894768",
  "search_keywords": {
    "title": "URGENT Plumber Needed",
    "location": "Central London, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Carpenter and joiner site worker",
  "location": "Central London, London",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "20 hours ago",
  "Salary": "depending on experience",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Sub Contractor",
  "none": "none",
  "Description": "Requires an Experienced, Reliable Carpenter and joiner to join our team.  Must be professional, able to read drawings and work to a high standard.  Covering All works from 1st fix to 2nd fix and supply and installing Joinery.  Monday to Friday 8:00 to 16:30 Excellent rates for the right person. Over time available if wanted.",
  "Ad_id": "5412000398",
  "search_keywords": {
    "title": "Carpenter and joiner site worker",
    "location": "Central London, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Cleaning Supervisor/Team Leader",
  "location": "Guildford, Surrey",
  "Hours": "Full Time",
  "Posted": "8 days ago",
  "Salary": "£10.62-£12 per hour",
  "Closes": "14 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "CLEANING SUPERVISOR-TEAM LEADER  Here are a few of the reasons why the Bright & Beautiful team of Cleaning Supervisors love working for us!  - Holiday pay  - School hours available  - No evenings or weekends!  - Full training  - Company uniform  - Full employment contract  - Supportive team and great managers  - Mileage allowance & Travel Pay  - Pension Scheme  Could this be the ideal role for me?  **  - We deliver dedicated housekeeping services to beautiful homes  - We believe in hiring positive, hardworking individuals who like to work to our high standards of service.  - It is important to us that every employee feels valued for their talents and are recognised for their hard work  - If you are looking to join a company that will reward your skills and dedication, working alongside a friendly, dedicated team of professionals, Bright & Beautiful is right for you.  We promote an inclusive team working environment so when you join our team you will truly become part of the family. If you have an affinity to our values, this is the ideal role for you.  As Cleaning Supervisor, you have the opportunity to develop your team using management and organisational skills in this interesting and varied role. This is field based, with most of your time spent cleaning with the housekeeping teams. You will coach and develop your team of housekeepers, whilst managing and identifying training needs to consistently improve the quality of service delivered by following our proven procedures.  Due to our continued success, we are proud to announce the expansion of our team of Domestic Cleaners. We are recruiting for full or part time hours covering GUILDFORD **and the surrounding areas.  As Cleaning Supervisor, you will have:  - Full UK driving license  - A keen eye for detail  - Meticulous standards  - A positive and courteous attitude  - An energetic and efficient approach to work  - Be a great people person",
  "Ad_id": "5411936794",
  "search_keywords": {
    "title": "Cleaning Supervisor/Team Leader",
    "location": "Guildford, Surrey"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Part time cleaners required immediate start in Evesham,Pershore,Droitwich,and Worcester .£12 an hour",
  "location": "Birmingham, West Midlands",
  "Hours": "Part Time",
  "Posted": "4 days ago",
  "Salary": "12 an hour",
  "Recruiter": "NATIONWIDE CLEANERS GLOS WARWICK WORCESTERSHIRE LTD",
  "Closes": "18 Jul 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "Recruiter Type": "Recruiter",
  "none": "none",
  "Description": "Cleaners are required for domestic cleaning work in Evesham, Pershore, Droitwich, Worcester,Bidford on Avon, Stratford upon Avon and surrounding areas  Reliable, punctual, and conscientious.  Drivers with the use of cars are ideal ..You must have a car unless you live locally  Part-time, Daytime-Weekdays  dusting and polishing furniture.  vacuuming/cleaning carpets.  mopping floor tiles.  Good interpersonal and communication skills",
  "Ad_id": "5411976401",
  "search_keywords": {
    "title": "Part time cleaners required immediate start in Evesham,Pershore,Droitwich,and Worcester .£12 an hour",
    "location": "Birmingham, West Midlands"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Dancers Wanted - Nightclub Dancers - Part time or full time dancers performers",
  "location": "Hatfield, Hertfordshire",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "12 hours ago",
  "Salary": "100-400 per night",
  "Recruiter": "After 8 Nightclub",
  "Closes": "18 Jul 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "Recruiter Type": "Direct Employer",
  "Description": "DANCERS to work in a luton night club part time or full time earning between 100-400 pounds per night immediate start no experience needed as training will be giving please call or email 07711378762 or info@after8club.co.uk",
  "Ad_id": "5411976935",
  "search_keywords": {
    "title": "Dancers Wanted - Nightclub Dancers - Part time or full time dancers performers",
    "location": "Hatfield, Hertfordshire"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Charity Fundraiser - Immediate start",
  "location": "London",
  "Language": "English",
  "Hours": "Full Time",
  "Posted": "8 days ago",
  "Salary": "Commission based, earn up to £14ph",
  "Recruiter": "Make It Count",
  "Closes": "14 Jul 2023",
  "Course": "No",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "We are now recruiting for a Charity Fundraiser with an immediate start.  ** AVAILABLE - TEMP WORK, FULL TIME or PART TIME ** FLEXIBLE HOURS ** ALL CANDIDATES MUST BE 18 OR OVER, LIVE IN THE UK AND ABLE TO COMMUTE TO OUR LONDON OFFICE DAILY!  Make it Count is an established company in the heart of London, with a high reputation and recognition for the services we provide to our clients & community. This is a field-based vacancy so you must be able to travel daily! We cover areas of London, Kent & Essex.  The role is to promote our clients by raising awareness of their activities by fundraising at pre-arranged supermarkets/shopping centres/train stations etc.  Our company is expanding non-stop so we are employing talented well-spoken Sales Representatives who can uphold our company’s culture and vision.  You must be able to speak fluent English, if you can speak more languages even better! You must be able to provide proof of ID and Residence to be considered for the role.  Experience is not necessary as we provide full product training, just need a willingness to learn! We welcome candidates with previous experience in Sales, Customer Service, Call Centre, Hospitality or Marketing.  You must be presentable with a smart appearance and very approachable!  We provide:  Full training for newbies and refresher course for the experienced  All marketing materials and equipment are provided including charity issued card machines for contactless donations  Benefits for you include:  *** paid 40% commission, also weekly bonuses for the super seller...!!! ***  *** Paid Cash Daily ***  *** Full Training and Support given by experienced trainers who have 20  years experience ***  *** A Buzzing Fun Fast Paced Environment ***  Immediate Start - CASH IN HAND DAILY - ***CALLING ALL TRUE SALES REPS TO APPLY NOW***  WHATSAPP the words ''PINK FUNDRAISER'' to 07554 473 709 to arrange to come to our Head Office in Whitechapel E1 6TD for your interview and to be registered. Please only contact between 10am till 6pm.  PLEASE ENSURE YOU ARE FLUENT IN ENGLISH & THAT YOU ARE A UK CITIZEN. Please bring proof of ID and Residence when you come to the office and also a bag e.g rucksack or holdall bag to carry your fundraising equipment in to start work that day or the following day if you are successful.  *** We will look forward to hearing from you! Apply today ***",
  "Ad_id": "5411937070",
  "search_keywords": {
    "title": "Charity Fundraiser - Immediate start",
    "location": "London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "HGV 2 Commercial Tradewaste Driver",
  "location": "Central London, London",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Negotiable",
  "Recruiter": "Corus Consultancy Ltd",
  "Closes": "29 May 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "Recruiter Type": "Direct Employer",
  "Description": "We are currently looking for a HGV2 driver to work for a waste collecting company based in the SE1 area.  You will be going out in a dustcart lorry collecting waste from commercial properties. This is a driver loader position so manual work will be required. A loader may also be provided to help.  This is a Monday to Friday role and weekends are optional.  Hours of work: 3am - 11am or 3pm - 11pm  You must hold a HGV2 licence, CPC card and Tacho Card.  Newly passed drivers are happily accepted too.  If you are interested in this role and would like find out more please give Tracey a call.",
  "Ad_id": "5411993754",
  "search_keywords": {
    "title": "HGV 2 Commercial Tradewaste Driver",
    "location": "Central London, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Chef",
  "location": "Warwick, Warwickshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Competitive salary depending on experience, pension, tips, 28 days holiday pay",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We’re looking for a new crew member for our awesome team. We’re a busy fresh food Canalside Pub. We have a passion for quality and service. We're Kiwi owned and managed.  28 days holiday Pension scheme Staff discount scheme Share of Tips Apprenticeship scheme available  Qualifications and Skills  An ability to stay calm when the pressure mounts Motivated, reliable and hard working Great culinary skills Team player Food Hygiene Certificate  if you feel you’ve got what it takes send us your cv",
  "Ad_id": "5411991479",
  "search_keywords": {
    "title": "Chef",
    "location": "Warwick, Warwickshire"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Pizza Chef",
  "location": "Cardiff",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "12 hours ago",
  "Salary": "£24,000",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Acapela Studio is one of the UK's leading small music venues (voted Best Music Venue in Cardiff 2018 and 6th Best Music Venue in Europe by readers of PROG Magazine 2020). With over 150 events a year the venue serves a range of pizzas prior to all concerts.  We are currently recruiting for:  A Pizza Chef – Shifts 4:00pm till 9:30pm. (Nights will vary based on rota.) Does include midweek events and some Fridays, Saturdays and Sundays .  Responsibilities and Duties  Responsibilities include maintaining the venues high quality food standards. You will ensure efficient Pizzeria operation, as well as maintain high production, productivity, quality standards.  Qualifications and Skills  1 year pizza chef experience  Our team members experience :  · Being part of a venue with a great warm family feeling  · Competitive rates of pay  · Full training  · A great work / life balance  - Food and drink on shift  What we’re looking for:  · A lovely enthusiastic personality  · Ability to work under pressure  So if you fancy joining our team of enthusiastic and great people, apply now!  Work Location: Acapela Studio, Heol Y Pentre, Nr. Cardiff. CF15 9QD  Job Types: Full-time, Part-time, Permanent  Salary: £24,000.00 per year  Benefits:  Discounted or free food  Schedule:  Day shift Monday to Friday Weekend availability  Ability to commute/relocate:  Pentyrch. Nr. Cardiff, CF15 9QD: reliably commute or plan to relocate before starting work (required)  Experience:  Chef: 1 year (preferred) Cooking: 1 year (required) Kitchen experience: 1 year (required)  Work authorisation:  United Kingdom (required)  Shift availability:  Day shift (required)  Work Location: In person",
  "Ad_id": "5412010577",
  "search_keywords": {
    "title": "Pizza Chef",
    "location": "Cardiff"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Part Time Multi Drop Driver - Night Shift",
  "location": "Limehouse, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "1 day ago",
  "Salary": "12.00 per hour Mon and Wed",
  "Recruiter": "Jones Brothers",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Direct Employer",
  "Description": "PART TIME Delivery Driver Role in London E14  If you are looking for a PART TIME delivery driving role on a long-term, permanent basis, with guaranteed hours and a consistent shift pattern each week, then please read on as this role could be for you.  We’re Jones Bros. A small, family run company based in London E14. We deliver Fresh Milk and Produce to customers throughout London and we are looking for a multi drop delivery rounds person to join our team on a PART TIME basis, working in the early hours of Monday morning and Wednesday morning of each week.  About the Job  We provide our customers with a top-class service, and as the face of our company, you will be doing the same, delivering fresh milk and other produce to our customers sites, whatever the weather, come rain or shine!  All you need is a Full UK Driving License and a positive, can-do attitude. Everything else within the role can be learned and taught.  You will be delivering to the same customers each week, so you will gain knowledge of your regular route and you will become familiar with the faces you meet along the way. This will include corporate offices, small businesses, and residential customers.  We will provide you with full training and support to ensure the role is a success.  We understand that you have a life outside of work, which is why we will offer you a permanent contract with guaranteed hours and a consistent shift pattern, ensuring you can plan ahead for any commitments you have outside of work.  So, if you are looking for a part time role on a long-term basis, with guaranteed hours and a consistent shift pattern, then this role may be for you.  Please be aware that this is a night-time position with a start time in the early hours of the morning. If you plan on using public transport, please check if you can travel to our site in E14 7BZ. Parking is available if you have your own transport.  Applications with a Cover Letter are preferred over applications without one and it would be beneficial if you could provide the reason you are specifically looking for part time role, as opposed to a full time role.  Salary: £12.00 p/hr  Hours: 15 per week  Shift Pattern: Monday and Wednesday (On a bank holiday Monday, the shift pattern will change to Tuesday and Wednesday, just for that week)  Start Time: Estimated 12am (Midnight)  Job Type: Part-time. Permanent.  Location: E14 7BZ",
  "Ad_id": "5411994913",
  "search_keywords": {
    "title": "Part Time Multi Drop Driver - Night Shift",
    "location": "Limehouse, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Live in Bar Staff",
  "location": "Bromley, London",
  "Language": "English",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "on interview",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We are looking for a live in bar staff. Experience is not essential but preferred There will be full inhouse training for all aspects of the job .We are a family run traditional pub which is very sports lead. We are looking for someone to add to a very well established team..",
  "Ad_id": "5411991487",
  "search_keywords": {
    "title": "Live in Bar Staff",
    "location": "Bromley, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Bricklayer",
  "location": "Southall, London",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "8 days ago",
  "Salary": "Good rates",
  "Recruiter": "Landmark Brickwork Ltd",
  "Closes": "14 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Description": "Bricklayers required.  Southall UB3.  Long run.  6 days.  Overtime available.  CSCS required.  07809 583 543.",
  "Ad_id": "5411936646",
  "search_keywords": {
    "title": "Bricklayer",
    "location": "Southall, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "ASSOCIATE DENTIST - FULL TIME - TRYST DENTAL PRACTICE, STENHOUSEMUIR",
  "location": "Stenhousemuir, Falkirk",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "1 day ago",
  "Salary": "Highly competitive",
  "Recruiter": "Clyde Dental Practice Limited",
  "Closes": "21 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "Clyde Munro is Scotland’s leading dental group, with 80 practices the length and breadth of the country. We’re responsible for the oral health of more than 600,000 patients – around one in every nine people living in Scotland trusts Clyde Munro to take care of their smiles.  Tryst Dental Practice is a 3 surgery practice located in Stenhousemuir, just 30-40 minutes from Edinburgh. This opportunity is perfect for a full-time Associate Dentist to join the group (Mon, Tues, Thur & Fri) at this time of growth with a first-class team.  This modern, fully equipped practice with digital scanner & xrays offers NHS, private and cosmetic treatments including clear aligners & teeth whitening, hygiene treatment and dental implants and is a well-led practice with a very supportive team.  Nearby you can enjoy beautiful coastal views and beaches. Its proximity to amenities such as eateries, pharmacy, post offices and shops as well as being within easy reach of Glasgow makes this clinic a very convenient location.  The services that this dental practice includes are:  General & Private dentistry Teeth whitening (chairside and take-home) Implants Sure Smile clear Aligners Invisalign Denplan Airflow  Who are we looking for?  Someone with the ambition to drive the expansion of the practice and provide a high level of clinical care - this is a growth position Experience in General & Private dentistry/ Facial Aesthetics/ and Invisalign A passion for continuous professional development is essential Experience with Software of Excellence (SOE) practice software is preferable but training will be provided GDC registration and VT number are essential  What can Clyde Munro offer you?  Dedicated Clinical Support team to help develop your career and grow your income Scotland's only dedicated in-house training facility with phantom heads and lecture rooms for hands-on and theoretical training Complementary or subsidised training for Associates including FREE Sure Smile Invisible Aligner training Digital Dentistry, we are working towards being impression free by 2023 Excellent green credentials and commitment to reducing our environmental impact Great clinical freedom and support from a fully trained team We support you in achieving a positive work-life balance Excellent earning potential & benefits  Not familiar with Central Scotland? Here's some of what this location has to offer:  Stenhousemuir is a town close to both Larbert and Falkirk and surrounded by countryside and landmarks such as the Falkirk Wheel and the Kelpies. It is within easy reach of major locations such as Edinburgh and Stirling with parking at the front of the practice.  For those with children about to enter Further Education, there are financial benefits to living and studying in Scotland with no University Fees for Scottish residents (terms apply)  Overseas Applicants:  Clyde Munro welcomes applications from overseas dentists. Visa sponsorship and relocation support are available and will be discussed in detail with successful applicants to support each candidate’s specific requirements.",
  "Ad_id": "5411991578",
  "search_keywords": {
    "title": "ASSOCIATE DENTIST - FULL TIME - TRYST DENTAL PRACTICE, STENHOUSEMUIR",
    "location": "Stenhousemuir, Falkirk"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "URGENT - Highly Skilled Carpenter Needed To Join Our Team",
  "location": "South East London, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "13 days ago",
  "Salary": "£43,000 - £45,500 / £170 - £190 Per Day / All Expenses Paid",
  "Closes": "09 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "JOB TITLE: Highly Skilled Carpenter  LOCATION: SW4 6DH, London, United Kingdom  TERMS: Self-employed  SALARY: £43,000 - £45,500 / £170 - £190 Per Day / All Expenses Paid  BENEFITS:  Parking & Petrol Paid For  Company Card For Materials  Brand New Van  Career Progression  Recognition For Excellence  Join a Growing Business  ABOUT US:  Our property maintenance company is seeking an experienced Carpenter to join our team. The ideal candidate will be responsible for performing a variety of carpentry tasks, including repairing and maintaining various structures on our properties. The Carpenter will also be responsible for ensuring that all work is completed in a timely and efficient manner and that all safety standards are met.  THE ROLE:  We are looking to expand our team and are seeking to recruit a dynamic Carpenter who takes pride in their work to join our team.  The successful candidate will be responsible for carrying out property repairs, maintenance tasks, and property inspections. You will deliver exceptional customer service and support the Maintenance team.  KEY TASK & RESPONSIBILITIES:  Visiting properties to diagnose and carry out repairs as per the schedule arranged for that day  Carry out carpentry (e.g., changing locks, handles, door replacements)  Repair and maintain structures such as walls, roofs, floors, decks, and fences.  Carry out basic handyman services (e.g., installation of blinds)  Carry out full refurbishments  Travel between jobs in and around London  Update jobs via app portal ensuring reports are written thoroughly and good quality before and after pictures are taken  Where jobs are to be quoted for to provide a report and links with the materials needed, and time needed to carry out the further repairs along with a description of the issue and the timing needed to rectify the issue  Working hours will be either be 8am-5pm or 9am-6pm  Thorough knowledge of local DIY stores in London  THE IDEAL CANDIDATE SHOULD HAVE:  Multi-skilled within the construction trade  Ability to carry out basic electrical duties/installations, basic plumbing work and carpentry and joinery  Must have their own tools  Clean valid UK driving license and must be over 25 years old due to insurance  Trustworthy with excellent quality workmanship  Ability to diagnose and carry out repairs whilst on site including the ability to source materials required  Good verbal and written communication skills  For more information, please visit our website at www.theoptimalgroup.co.uk or send an email to recruitment@theoptimalgroup.co.uk or call us on 0208 004 4442  Please send your C.V to recruitment@theoptimalgroup.co.uk Immediate start",
  "Ad_id": "5411894632",
  "search_keywords": {
    "title": "URGENT - Highly Skilled Carpenter Needed To Join Our Team",
    "location": "South East London, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Kitchen assistant, 18 weeks holiday",
  "location": "Aylesbury, Buckinghamshire",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "5 days ago",
  "Salary": "£11 / hour",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Here at Bruern Abbey Senior School, we are recruiting a Kitchen Assistant to work with the small kitchen team, helping to prepare and serve dinners during the week.  Hours of work, 25 hours per week:  Monday - Thursday: 4pm - 9pm  Friday: 12pm - 5pm  The catering assistant assists with food preparation and washing up in the afternoon, then helps the chef serve the dinner, then wash up and clean down the kitchen. On Fridays, the boys leave after lunch, and the kitchen is deep-cleaned ready for the next week.  No experience is needed for the role, and uniform, shoes and meals on duty are provided. The kitchen team is small, firendly and welcoming. This position would suit someone looking for a job with plenty of paid time off (especially in school holidays), or someone with an interest in working in the catering industry.  The job is fairly physical and you will be on your feet most of the day, but it is a fun and varied place to work - no two days are the same! Due to the location of the school, having access to your own transport would be useful, unless you live in Chilton village - the public transport access is not very good, especially in the evening.",
  "Ad_id": "5411968879",
  "search_keywords": {
    "title": "Kitchen assistant, 18 weeks holiday",
    "location": "Aylesbury, Buckinghamshire"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Experienced Gardener/Handyperson",
  "location": "Blairgowrie, Perth and Kinross",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "17 hours ago",
  "Salary": "Around £25,000 per year subject to detailed agreement + cottage + private pension scheme",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Permanent full-time position to work for a private family on a beautiful Estate in Perthshire, Scotland. Part-time housekeeping work for partner also available, but not essential.  The estate owners live at the main house and run a busy farm. They are low key, very active, with a down to earth, hands-on approach and are very much involved in the everyday activities of the Estate.  The role includes a comfortable self-contained cottage on the estate with beautiful views. The cottage is unfurnished and comprises three bedrooms, living room and kitchen. Central heating, fully fenced garden with outbuildings. Firewood supplied.  This role would be suitable for an experienced gardener who enjoys working in the rural setting of a country estate and ideally you will have had experience in this role previously. Teamwork is encouraged with other members of staff working on the farm and on the estate.  Couples with young families are welcome, as the community support structure is excellent and the access to fresh air, nature and space is in abundance. The local primary school is 2 miles away and there is a school bus in circulation. Access to shops, other amenities and medical facilities are all within 11 miles. The Estate is conveniently located in the beautiful Highlands, yet within reasonable distance to cities such as Perth, Dundee and Edinburgh.  Applicants should be physically fit, self-motivated and hard working.  Duties include:  Spring months – preparation of the vegetable garden and polytunnel, sowing vegetable seeds  Summer months - maintenance of the orchard, mowing, planting, weeding, strimming and general maintenance of a well-established beautiful garden Autumn requires pruning, putting the garden to bed, maintenance of gardening machinery and assisting the forestry team with log cutting for winter Winter requires salting of roadways, maintaining clear access. Working with the forestry team when required to ensure stock of firewood and clearance of fallen trees All year, there is an element of maintenance required to the main house and its outbuildings Use of an ATV during working hours to enable access to all areas of the estate. On occasions when the owners are away, security measures of the main house will be necessary  Candidates should :  be experienced in a similar role be well-organised and able to follow clear work plan have a strong work ethic enjoy the outdoors with lots of variety be willing to be flexible, adaptable, creative and to take on ad hoc tasks possess a calm and responsible personality respect high standards of discretion and confidentiality have a clean driving licence be a dog-lover and prepared to care for employer’s dogs when they are away.  Training  Training will be provided in use of specialised equipment where required  Work Hours:  Monday to Thursday - 8am to 5pm and Fridays 8am to 4pm with 1 hour break  Remuneration  around £25,000 per year, according to experience. Rent-free occupation of cottage; Council tax paid; generous private pension scheme  If you are interested in this position, please e mail with your CV and description and why you are interested in this role. This position is to start as soon as possible. Interviews and reference checks will take place before making an offer.",
  "Ad_id": "5412002435",
  "search_keywords": {
    "title": "Experienced Gardener/Handyperson",
    "location": "Blairgowrie, Perth and Kinross"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "nanny",
  "location": "London",
  "Hours": "Full Time",
  "Posted": "13 days ago",
  "Salary": "£15 per hour",
  "Closes": "09 Jun 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "none": "none",
  "Description": "We are looking for someone who can care for our daughter who is aged 11 years old and has special needs. She is full of life and personality. We are a family of 5 including 2 other children aged 9 & 6 years based in Wimbledon, SW20. We would be looking for someone to start on a full-time basis immediately:  Term time cover will include:  Monday - Thursday After school from 15:45 – 8:00 pm  Friday After school from 2:30 – 8:00 pm  Saturday 8 am – 2pm .  School Holidays (approx. 13 weeks): Note: (times are flexible)  Monday 9:00 – 18: 30 pm  Tuesday 9:00 – 18: 30 pm  Wednesday After holiday school from 3:00 – 8:00 pm  Thursday After holiday school from 3:00 – 8:00 pm  Friday 9:00 – 18: 30 pm  Saturday 8am – 2pm .  We are looking for someone reliable, enthusiastic, willing to take on new challenges and most important very patient.  We are a very approachable, easy-going family and are always on hand to help. We understand that working with special needs can sometimes be a challenge and we always provide support as needed. We are VERY flexible with working hours.  We pay cash in hand £15 / hour. Special needs Experience is NOT required. It is important to us as parents that both our daughter and who ever chooses to work with her are happy. As such we can set up some trail days to ensure this.  If you would like more information regarding the role please don’t hesitate to contact us . We look forward to hearing from you.",
  "Ad_id": "5411897125",
  "search_keywords": {
    "title": "nanny",
    "location": "London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Community Team Member - The Fisheries",
  "location": "Hackney, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Competitive salary with sociable hours and excellent working conditions.",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Job Description  Community Team Member/Customer Service – The Fisheries London Fields.  Full Time and Site based  Equivalent salary £13.50/hour  Location  London Fields, Hackney, London.  Venue  Home to entrepreneurs, small businesses and individuals from numerous industries, The Fisheries is a members’ working and events space, in the heart of London Fields, Hackney, London.  Our lovely offices and communal spaces are individual, welcoming and are regarded as a home away from home by our members, creating a warm, personalised and professional atmosphere.  But it is our outstanding, friendly and professional service is our central priority, and what makes The Fisheries much loved by our members.  Who are we?  The Fisheries was founded in Hackney in 2019. We employ local people, run events for local people and provide workspace for some of the brightest and most interesting businesses.  We create, and operate a beautiful workspace where people feel welcome, safe, and above all happy. We create opportunities for them to connect professionally, personally, internally and with the wider community, and we create a team that’s sole purpose is to look after them.  The Role  You will be responsible for taking care of our members and their guests at reception and elsewhere in the building, as well as supporting the rest of the team as needed. You will work on a shift basis, generally between 8am and 8pm, but you will be expected to be able to work some evenings and weekend shifts, and events as and when required.  Main Duties:  Greet all members and their guests in a friendly, but professional way. Answer questions regarding the operating of the building. Help members and their guests enjoy their experience at The Fisheries. Answer the phone and deal with enquiries. Conduct tours of The Fisheries to prospective members. Write and receive emails regarding the space and sales leads. Conduct regular checks of the space to make sure it is running smoothly. Open and close the building. Get involved in members events and activities and promote the community.  You will need:  At least 1 year front of house experience in a fast-paced hospitality environment. Availability to work evenings and weekends (occasionally). Excellent written and verbal English language communication skills. Excellent communication, problem solving and listening skills. Computer savvy with PC’s and Mac’s. Exceptional attention to detail. A professional and well-groomed appearance, as you are the first impression of The Fisheries. An ability to multi-task and follow directions. Flexibility in your work times to meet business needs.  Only those eligible to work in the UK or have a valid UK work permit/visa will be considered for the above role.  Benefits  The opportunity to work within a vibrant community. Competitive salary within the hospitality industry. In house training. Paid break. 28 days holiday allowance (including bank holidays). Potential to expand your knowledge base. Sociable hours.",
  "Ad_id": "5411990602",
  "search_keywords": {
    "title": "Community Team Member - The Fisheries",
    "location": "Hackney, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "CLAPHAM JUNCTION-SW18 - FULL TIME LIVE OUT EXPERIENCED HOUSEKEEPER/COOK",
  "location": "Clapham Junction, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "19 hours ago",
  "Salary": "CIRCA £650.00 NET PER WEEK",
  "Recruiter": "The Graham Agency",
  "Closes": "22 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "WORKING PARENTS WITH 2 TEENAGE GIRLS AND A SMALL DOG REQUIRE A SELF MOTIVATED HOUSEKEEPER/OCCASIONAL FAMILY COOK FOR THEIR SUPER HOE NEAR CLAPHAM JUNCTION.  TO MANAGE YOUR TIME EFFICIENTLY AND WORK ALONE MONDAY TO FRIDAY CIRCA 40 HOURS PER WEEK, FULLY FLEXIBLE.  YOU WILL BE SOLELY RESPONSIBLE FOR ALL HOUSEKEEPING DUTIES/FULL WARDROBE MANAGEMENT/FINE FURNISHINGS/FINE FABRICS/SHOPPING/PET CARE  DEAL WITH GARDENERS/TRADE PERSONS/WORKMEN/VISITORS  TRAVEL WITH THE FAMILY IS POSSIBLE BUT NOT ESSENTIAL  GOOD ENGLISH TO START AS SOON AS CANDIDATE SOURCED.",
  "Ad_id": "5412000505",
  "search_keywords": {
    "title": "CLAPHAM JUNCTION-SW18 - FULL TIME LIVE OUT EXPERIENCED HOUSEKEEPER/COOK",
    "location": "Clapham Junction, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "Cleaners wanted in Rownhams £12/hour cash",
  "location": "Southampton, Hampshire",
  "Job Level": "Experienced",
  "Hours": "Part Time",
  "Posted": "13 days ago",
  "Salary": "£12/hour cash",
  "Recruiter": "Nationwide Cleaners",
  "Closes": "09 Jul 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "Recruiter Type": "Direct Employer",
  "Description": "Part-time house cleaners wanted on the weekdays in the day time. School hours.  The cleaning job starts with 2 hours and increases over time as the work comes in to as many hours as you want.  £12 per hour cash in hand.  The client provides the cleaning materials.  We are looking for people who are:  Experienced cleaners Reliable and turn up each week Good communicators and let us and the client know if you can't make the clean with as much notice as possible. Looking for a long-term cleaning job",
  "Ad_id": "5411894520",
  "search_keywords": {
    "title": "Cleaners wanted in Rownhams £12/hour cash",
    "location": "Southampton, Hampshire"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "URGENT - Highly Skilled Carpenter Needed To Join Our Team",
  "location": "West Ealing, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "13 days ago",
  "Salary": "£43,000 - £45,500 / £170 - £190 Per Day / All Expenses Paid",
  "Closes": "09 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "JOB TITLE: Highly Skilled Carpenter  LOCATION: SW4 6DH, London, United Kingdom  TERMS: Self-employed  SALARY: £43,000 - £45,500 / £170 - £190 Per Day / All Expenses Paid  BENEFITS:  Parking & Petrol Paid For  Company Card For Materials  Brand New Van  Career Progression  Recognition For Excellence  Join a Growing Business  ABOUT US:  Our property maintenance company is seeking an experienced Carpenter to join our team. The ideal candidate will be responsible for performing a variety of carpentry tasks, including repairing and maintaining various structures on our properties. The Carpenter will also be responsible for ensuring that all work is completed in a timely and efficient manner and that all safety standards are met.  THE ROLE:  We are looking to expand our team and are seeking to recruit a dynamic Carpenter who takes pride in their work to join our team.  The successful candidate will be responsible for carrying out property repairs, maintenance tasks, and property inspections. You will deliver exceptional customer service and support the Maintenance team.  KEY TASK & RESPONSIBILITIES:  Visiting properties to diagnose and carry out repairs as per the schedule arranged for that day  Carry out carpentry (e.g., changing locks, handles, door replacements)  Repair and maintain structures such as walls, roofs, floors, decks, and fences.  Carry out basic handyman services (e.g., installation of blinds)  Carry out full refurbishments  Travel between jobs in and around London  Update jobs via app portal ensuring reports are written thoroughly and good quality before and after pictures are taken  Where jobs are to be quoted for to provide a report and links with the materials needed, and time needed to carry out the further repairs along with a description of the issue and the timing needed to rectify the issue  Working hours will be either be 8am-5pm or 9am-6pm  Thorough knowledge of local DIY stores in London  THE IDEAL CANDIDATE SHOULD HAVE:  Multi-skilled within the construction trade  Ability to carry out basic electrical duties/installations, basic plumbing work and carpentry and joinery  Must have their own tools  Clean valid UK driving license and must be over 25 years old due to insurance  Trustworthy with excellent quality workmanship  Ability to diagnose and carry out repairs whilst on site including the ability to source materials required  Good verbal and written communication skills  For more information, please visit our website at www.theoptimalgroup.co.uk or send an email to recruitment@theoptimalgroup.co.uk or call us on 0208 004 4442  Please send your C.V to recruitment@theoptimalgroup.co.uk Immediate start",
  "Ad_id": "5411894596",
  "search_keywords": {
    "title": "URGENT - Highly Skilled Carpenter Needed To Join Our Team",
    "location": "West Ealing, London"
  }
},{
  "timestamp": "24/05/2023 11:20:08",
  "title": "URGENT - Highly Skilled Carpenter Needed To Join Our Team",
  "location": "South East London, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "13 days ago",
  "Salary": "£43,000 - £45,500 / £170 - £190 Per Day / All Expenses Paid",
  "Closes": "09 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "JOB TITLE: Highly Skilled Carpenter  LOCATION: SW4 6DH, London, United Kingdom  TERMS: Self-employed  SALARY: £43,000 - £45,500 / £170 - £190 Per Day / All Expenses Paid  BENEFITS:  Parking & Petrol Paid For  Company Card For Materials  Brand New Van  Career Progression  Recognition For Excellence  Join a Growing Business  ABOUT US:  Our property maintenance company is seeking an experienced Carpenter to join our team. The ideal candidate will be responsible for performing a variety of carpentry tasks, including repairing and maintaining various structures on our properties. The Carpenter will also be responsible for ensuring that all work is completed in a timely and efficient manner and that all safety standards are met.  THE ROLE:  We are looking to expand our team and are seeking to recruit a dynamic Carpenter who takes pride in their work to join our team.  The successful candidate will be responsible for carrying out property repairs, maintenance tasks, and property inspections. You will deliver exceptional customer service and support the Maintenance team.  KEY TASK & RESPONSIBILITIES:  Visiting properties to diagnose and carry out repairs as per the schedule arranged for that day  Carry out carpentry (e.g., changing locks, handles, door replacements)  Repair and maintain structures such as walls, roofs, floors, decks, and fences.  Carry out basic handyman services (e.g., installation of blinds)  Carry out full refurbishments  Travel between jobs in and around London  Update jobs via app portal ensuring reports are written thoroughly and good quality before and after pictures are taken  Where jobs are to be quoted for to provide a report and links with the materials needed, and time needed to carry out the further repairs along with a description of the issue and the timing needed to rectify the issue  Working hours will be either be 8am-5pm or 9am-6pm  Thorough knowledge of local DIY stores in London  THE IDEAL CANDIDATE SHOULD HAVE:  Multi-skilled within the construction trade  Ability to carry out basic electrical duties/installations, basic plumbing work and carpentry and joinery  Must have their own tools  Clean valid UK driving license and must be over 25 years old due to insurance  Trustworthy with excellent quality workmanship  Ability to diagnose and carry out repairs whilst on site including the ability to source materials required  Good verbal and written communication skills  For more information, please visit our website at www.theoptimalgroup.co.uk or send an email to recruitment@theoptimalgroup.co.uk or call us on 0208 004 4442  Please send your C.V to recruitment@theoptimalgroup.co.uk Immediate start",
  "Ad_id": "5411894632",
  "search_keywords": {
    "title": "URGENT - Highly Skilled Carpenter Needed To Join Our Team",
    "location": "South East London, London"
  }
},{
  "timestamp": "25/05/2023 18:16:55",
  "title": "Post Office Counter Clerk - Part Time",
  "location": "West Hampstead, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Part Time",
  "Posted": "1 day ago",
  "Salary": "11.95 per hour",
  "Recruiter": "The Sherriff Centre Limited",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "We are looking for someone with customer service experience to work at our Post Office. The hours are between 8 - 12 per week and will be across Monday to Friday. The hours will be worked on different days depending on other staff annual leave and the needs of the business. A rota will be supplied a minimum of a month in advance.  Purpose of post;  To work as a team member within the Post Office at The Sherriff Centre, helping us deliver an excellent customer experience.  Main tasks;  Serving customers  Operating Post Office Horizon tills  Handling cash and stock  Informing customers about Post Office products  Opening and closing procedures  Who would this role suit?;  Post Office experience is desirable for this role, however, a positive attitude and great customer service skills are just as important, as full on the job training is provided.  The post would suit someone who has a sales or retail background, enjoys a customer facing role and has excellent communication skills, is honest and has good attention to detail.  We are looking for;  Post Office experience/or sales/retail experience, minimum 1 year.  Excellent customer service skills  Ability to learn new systems and processes  A positive, ‘can do’ attitude  Good communication skills  Reliable and trustworthy  A friendly and professional manner  The ability to work well in a team",
  "Ad_id": "5412026794",
  "search_keywords": {
    "title": "Post Office Counter Clerk - Part Time",
    "location": "West Hampstead, London"
  }
},{
  "timestamp": "25/05/2023 18:16:55",
  "title": "Parcel Delivery",
  "location": "St Helens, Merseyside",
  "Hours": "Part Time",
  "Posted": "1 day ago",
  "Salary": "£20-£40 Per Hour",
  "Recruiter": "Advio",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Sub Contractor",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Job Title: Parcel Delivery Driver  Location: Merseyside  Job Type: Flexible, Part-time/Full-time  Salary: £20-£40 per hour (average pay)  We are currently seeking reliable and motivated individuals to join our team as Parcel Delivery Drivers. As a delivery driver, you will be responsible for delivering parcels to customers in your local area using your own car or van.  Key Responsibilities:  Collecting parcels from the depot and delivering them to customers' addresses Ensuring parcels are delivered on time and in good condition Providing excellent customer service Maintaining accurate records of deliveries made Ensuring that all parcels are delivered safely and securely  Requirements:  A full UK driving license and access to your own car/van Valid Insurance,MOT & Tax A smartphone with GPS capabilities Good communication skills and the ability to provide excellent customer service Flexibility to work on a part-time basis, with the ability to choose your own hours No previous experience required, training will be provided  Benefits:  Bi-weekly pay Pay for each item you deliver Competitive hourly rate, with highly achievable pay rates of £20-£40 per hour Flexible working hours, allowing you to choose when you want to work The ability to go straight home after completing your deliveries, with no need to return to the depot Excellent Work-Life balance  We Have work 7 days a week it's up to you to when you want to work, no commitments!  If you are interested in this exciting opportunity, please apply now via WhatsApp stating your full name,email address and area you wish to work.",
  "Ad_id": "5412026706",
  "search_keywords": {
    "title": "Parcel Delivery",
    "location": "St Helens, Merseyside"
  }
},{
  "timestamp": "25/05/2023 18:16:55",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Northampton, Northamptonshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 hour ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038197",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Northampton, Northamptonshire"
  }
},{
  "timestamp": "25/05/2023 18:16:55",
  "title": "Legal Secretary",
  "location": "Abergavenny, Monmouthshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Dependent on experience",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "For this role we are looking for an experienced legal secretary  The Company:  Star Legal is a successful and growing legal firm with a head office based in Bristol and other offices based around the South West and Wales. Our clients include those local to the South West and Wales, UK national clients and international clients.  The Job:  We are searching for an experienced Legal Secretary in our Abergavenny office, mainly dealing with probate.  Secretarial support to fee earners  Communicating with clients and other related parties.  Answering the telephone  Transcription of Dictation.  Diary Management.  File Management – Electronic filing of documents and paper filing.  Working within an electronic case management system.  Time recording.  The Person:  For this role we are seeking previous legal secretary (ideally in probate)  The Benefits:  20 days plus bank holidays  The Hours:  Monday – Friday 9am – 5pm  The Salary:  Dependent on experience",
  "Ad_id": "5412026811",
  "search_keywords": {
    "title": "Legal Secretary",
    "location": "Abergavenny, Monmouthshire"
  }
},{
  "timestamp": "25/05/2023 18:16:55",
  "title": "Young Energetic Store Incharge (Sales), Full Training Provided -London Victoria and Oxford Circus",
  "location": "Central London, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "12 days ago",
  "Salary": "10k to 24k per annum",
  "Closes": "12 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "JOB VACANCIES  YOUNG ENERGETIC STORE INCHARGE (SALES), FULL TRAINING PROVIDED - LONDON VICTORIA AND OXFORD CIRCUS  FULL TIME / PART TIME  The ShipCentre is looking for young, energetic, self-motivated sales associates for our new store in London. Full training will be provided, experience is not essentially necessary.  The ShipCentre is a multi-service provider such as Passport Photos Service, Courier Service, Mailbox Rentals and Print Shop services; all under a single roof; for you this is a multi-role position and it can be challenging, love being challenged? if yes, then it is for you.  This is a great opportunity for you, to learn and earn, gain experience if you have none, in the uni or freshly graduate. Becoming a part of our organisation will help you grow your multi level skills which could be beneficial for you for your career oriented job.  You will be the face of organisation therefore it is important that you are presentable, customer friendly, good communicator and able to make sale while providing excellent customer service in person and over the phone; occasionally able to take pressure and perform multi-tasking quickly.  REQUIREMENT:  Quick learner  Friendly team player / leader  Good e-mail writing skills  Some knowledge of Microsoft software, Word, Excel, and PowerPoint; Adobe PhotoShop is a plus  ESSENTIAL:  Good personality with inter-personal skills  Always-on smile and vibrant personality  Soft spoken verbal communicator  Have an eye for detail  Be attentive  DUTIES:  Opening and/or Closing of the store.  Attending phone calls.  Greeting customers (In person and over the phone)  Requesting and understanding customers what they are looking for?  Explaining the services we offer.  Taking a picture with a digital camera, process, email/print and cut it.  Calculating price for the service required by customers.  Filling online form to create shipments.  Pack the contents of shipment in a box.  Handling cash till  Processing card transaction  Recording the sales  Recording shipment data online.  Updating records in Microsoft Excel template sheet  Helping customers to create mailbox account and upload their documents.  Taking print orders and process them.  Correspond with customers (In-person and over the phone)  Correspond with vendors (In-person and over the phone)  Keeping the store floor and front tidy and clean  FOR YOU:  Two weeks free training  Competitive per hour rate  Travel allowance during training period  Performance related yearly bonus opportunity  Free staff refreshment  FLEXIBLE SHIFTS FOR PART TIME:  Monday to Friday: 8.00am - 3.00pm and 3.00pm - 9.00pm  Saturday: 9.00am to 7.00pm  Sunday and Bank Holidays: 10.00am - 8.00pm  FULL TIME SHIFTS:  Monday to Friday: 8.00am - 5.00pm (45 Hours per week)  HOW TO APPLY:  E-mail your CV: jobs@theshipcentre.com  Reference: VBR/GT0523",
  "Ad_id": "5411921850",
  "search_keywords": {
    "title": "Young Energetic Store Incharge (Sales), Full Training Provided -London Victoria and Oxford Circus",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Helper and Cleaner for Private Family",
  "location": "Inverness, Highland",
  "Language": "Spanish",
  "Job Level": "Experienced",
  "Hours": "Part Time",
  "Posted": "2 days ago",
  "Salary": "£15 per hour plus holiday pay",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Cleaner and Home Help for a Private Family  Are you a reliable, proactive, and organized individual seeking a rewarding part-time position? Look no further! We have an excellent opportunity for a Cleaner and Home Help to join a private family, providing essential assistance with household tasks and supporting a disabled parent.  Position: Cleaner and Home Help  Working Hours: 12 hours per week, flexible times during day (Monday, Wednesday, Friday)  Employment Type: Employee (taxes and national insurance deductions apply)  Location: Inverness, near Holm Mains  Responsibilities:  - Maintain a clean and tidy living environment through regular cleaning tasks.  - Organize and arrange items to ensure an efficient and orderly home.  - Manage laundry and ironing to keep clothing fresh and presentable.  - Exercise initiative in developing a plan for workload management to accomplish tasks efficiently, reducing the need for micromanagement.  - Provide compassionate support to the disabled parent, considering their unique needs. No care activities required but your discretion & confidentiality is appreciated.  Requirements:  - Reliability is crucial; we need someone who consistently meets their assigned schedule and responsibilities.  - Strong organizational skills to independently plan and execute household tasks.  - Previous experience in cleaning, housekeeping, or a similar role is preferred.  - A compassionate and empathetic nature, essential when assisting a disabled parent.  - Excellent communication skills to understand and fulfill the family's specific requirements.  Compensation and Benefits:  - Hourly wage of £15.  - Holiday entitlement will be provided.  - Enjoy a supportive work environment where your efforts are recognized and appreciated.  - Flexibility. We can work around your needs if given adequate notice.  This role presents a fantastic opportunity to make a meaningful difference in the lives of a family that truly values your assistance. If you possess the necessary skills and qualities, we would be delighted to hear from you.  To apply, please submit your CV and a concise cover letter outlining your relevant experience and demonstrating why you are the ideal candidate for this position. We eagerly await reviewing your application!  *Note: All applications will be treated with the utmost confidentiality.*",
  "Ad_id": "5411996315",
  "search_keywords": {
    "title": "Helper and Cleaner for Private Family",
    "location": "Inverness, Highland"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Chef",
  "location": "Chessington, Surrey",
  "Language": "English",
  "Hours": "Full Time",
  "Posted": "7 days ago",
  "Salary": "UP TO 38,0000 per annum",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Job Title: Chef  The King William IV is looking for an additional Chef to join our friendly kitchen team.We are an award winning independent country pub located in the beautiful Surrey Hills, As a Chef, you will be helping with our kitchen operations, including food preparation, menu planning, and staff management. The ideal candidate should demonstrate excellent cooking skills, and have a strong knowledge of various cuisines and cooking techniques and be used to working with fresh foods.  Responsibilities:  Prepare and cook a wide variety of dishes to meet quality and presentation standards. Supervise and train kitchen staff, including cooks, prep cooks, and dishwashers. Maintain a clean and organised kitchen, following sanitation regulations and safety standards. Order and manage inventory of food and supplies, ensuring optimal levels and minimising waste. Collaborate with the management team to create innovative and appealing menu items  Experience:  Minimum of two years experience working in a professional kitchen .  Ability to work well under pressure and in a fast-paced environment. Excellent attention to detail and organisational skills. Knowledge of food safety and sanitation regulations. Excellent communication and interpersonal skills.  Salary: Salary for this position is up to £38,000, commensurate with experience and qualifications.  Please submit your CV and a covering letter telling us a bit about yourself",
  "Ad_id": "5411967677",
  "search_keywords": {
    "title": "Chef",
    "location": "Chessington, Surrey"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "E-Commerce Customer Service Manager",
  "location": "North Berwick, East Lothian",
  "Language": "English",
  "Job Level": "Management",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Up to £30,000 per annum + Benefits",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Customer Service Manager wanted for an online retailer of specialist outdoor clothing & equipment.  A fantastic opportunity has arisen for a Customer Service Manager to combine their enthusiasm for the great outdoors with their flair for customer service and great administration.  Established in 2010 by people who were born and raised in the country, ArdMoor.co.uk has gone from strength to strength. Focusing on all things outdoor, from country clothing and footwear to shooting, stalking, sailing, outdoor and work clothing & equipment. ArdMoor has quickly become one of the leading companies in its marketplace. Now we need your help to take us to the next stage in our development.  THE ROLE:  We are looking for a person to join our ambitious team, where you’ll be responsible for giving our customers a world class experience of shopping online at ArdMoor ensuring they return to shop with us again.  Alongside others in the team, you will be deal with our customer’s enquiries, telephone orders and any issues arising with their orders once placed to include managing parts of our back-office stock management system and inputting into the content that is shown on our web site.  This is an exciting opportunity for an enthusiastic team player looking to make their mark in a close-knit team doing a job that is key to the development of our business.  You’ll have a proven track record of excellent communication skills, fantastic telephone manner, dealing with members of the public, giving clear and concise guidance and advice as required and of problem solving. Communication and lateral thinking are two of your key strengths and you’ll be able to bring a cheerful, respectful approach to dealing with our customers as a result.  Reliability in completing work to agreed standards and in a timely fashion and being process driven are essential skills. Your outstanding communication skills will ensure you’re able to keep other team members informed of progress and any issues.  You’ll report to the Web Trading Manager and will have an enthusiastic, self-motivated approach to work that will enable you to work both independently and as an influential team member from day one.  Key Responsibilities  Deliver customer satisfaction and retention through ensuring teams timely response to orders, product delivery, issues, faulty items, and complaints. Develop plans and targets and report on metrics to improve customer satisfaction. Develop customer service policies, procedures, and standards and ongoing training of these procedures. Be committed to meeting KPIs, including quality and productivity targets; playing a pivotal role in helping the department to achieve its overall goals. Be the ‘go to’ for any customer service team queries. Overall responsibility of the training and development of your team. Communicate relevant messages to your team about merchandising and upsell of items held in the warehouse. Be the 'voice' of the customer within ArdMoor and provide feedback to all other teams to drive continuous product improvement and customer success. Develop an in-depth understanding of our products and run regular training sessions alongside Ops Manager on new products added to the website, with a focus on forward order items which will be held in the warehouse. Liaise with external suppliers to ensure prompt delivery of items. Place and oversee Purchase Orders daily, and daily checking by yourself or team members so that these items arrive in a timely fashion to avoid orders being cancelled. Encourage the team to make phone calls rather than emails to suppliers to get faster responses. Processing of faulty claims with suppliers and timely communication with customers about a resolution. Encourage the team to offer an alternative item held in the warehouse before customer cancelling order. Ensuring swift handling of leads to relevant sales teams, and encourage your team to be aware of the customer they are speaking to - ie VIP Manage the day-to-day customer service team (including home workers) to ensure that the telephones are covered and that lunch breaks do not clash where possible. Overall responsibility to lead, inspire, develop, and motivate customer service team to deliver a best-in-class customer experience. Support colleagues with the use of in-house tools, by providing necessary training and advice. Carry out all tasks in an efficient professional and courteous manner, leading by example to the Customer Service Department. Liaise with the Financial Controller about invoices and credits. Continue to learn.  Requirements  Great communication skills Excellent telephone manner Problem Solving can-do attitude. Experience working in the retail sector advantageous. Proven track record in sales experience IT literacy – in particular MS Office High attention to detail Proactive team player, with excellent communication skills Self-motivated and enthusiastic approach Experience of, or interest in, at least one of the key areas of our key marketplaces ie shooting, outdoors, workwear, sailing, country etc advantageous  WHAT YOU CAN EXPECT FROM THE ROLE  You will be part of one of the UK’s premium outdoor e-tailers. You will be based in our office at Kingston, North Berwick, East Lothian EH39 5LT. You will have access to support and training where you will get as much assistance as you require. You will have a generous staff discount on all products on the ArdMoor site. How To Apply: Please email your CV and a covering letter to Caroline Campbell on cc@ardmoor.co.uk",
  "Ad_id": "5412029400",
  "search_keywords": {
    "title": "E-Commerce Customer Service Manager",
    "location": "North Berwick, East Lothian"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Cook / Housekeeper , Live in available - Chelsea",
  "location": "Central London, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 days ago",
  "Salary": "£45k - £50k",
  "Closes": "18 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Small family require a live-in Cook / Housekeeper, Family employ daily housekeepers so housekeeping will be minimum on days off of other staff  Must be able to cook healthy meals for principle, Asian cuisine an added bonus  This is a very relaxed household and quite non stressful position  You must be able to travel to Europe & America with principle when needed.  Contactable references a must",
  "Ad_id": "5411976253",
  "search_keywords": {
    "title": "Cook / Housekeeper , Live in available - Chelsea",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Multi Tradesperson - Work for a reliable & forward thinking Property Developer!",
  "location": "Central London, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "6 days ago",
  "Salary": "Up to £190 p.d. plus company vehicle & travel expenses",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "none": "none",
  "Description": "Gaughan Group provide a full and comprehensive range of property facilities management, building services, construction, and maintenance solutions to high end commercial clients across London and Wiltshire.  Gaughan Group cover all residential maintenance, disabled adaptations and can undertake any type of refurbishment project within most types of contractual framework.  Celebrating 11 years in Business. Experts trained and certified in all our trades. Trusted by Property Managers and Landlords.  We are looking for new multi trades person to join our growing business. We have several sites in Wiltshire which will follow continuously one after the other, so we require reliable and multi skilled workers to join our ever growing team. The works will be a mixture of maintenance, refurbs and larger projects, so varied experience and being able to be flexible is key!  You will require generic experience across the board of the following:  Bathroom and kitchen refurbishments General carpentry Foundations/groundwork/Roofing Strong knowledge of plumbing and electrical Extensions Tiling Internal renovations Brick work/blockwork All other aspects of the building trades  Your duties will include -  Meeting with potential customers, discussing the works they require, taking measurements etc and relaying the information back to the project managers Keeping working areas clean and tidy Working to a schedule of works and timeframes Ensuring health and safety procedures and safe working practices are adhered to. To carry out all works to the highest standard  Candidates must have their own tools and be fluent in English.  This is a fantastic opportunity to become a part of a busy, progressive company who can offer a rewarding working environment and scope for future growth and progression.  This role is working on a self employed basis.",
  "Ad_id": "5411968145",
  "search_keywords": {
    "title": "Multi Tradesperson - Work for a reliable & forward thinking Property Developer!",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Kitchen assistant, 18 weeks holiday",
  "location": "Aylesbury, Buckinghamshire",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "6 days ago",
  "Salary": "£11 / hour",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Here at Bruern Abbey Senior School, we are recruiting a Kitchen Assistant to work with the small kitchen team, helping to prepare and serve dinners during the week.  Hours of work, 25 hours per week:  Monday - Thursday: 4pm - 9pm  Friday: 12pm - 5pm  The catering assistant assists with food preparation and washing up in the afternoon, then helps the chef serve the dinner, then wash up and clean down the kitchen. On Fridays, the boys leave after lunch, and the kitchen is deep-cleaned ready for the next week.  No experience is needed for the role, and uniform, shoes and meals on duty are provided. The kitchen team is small, firendly and welcoming. This position would suit someone looking for a job with plenty of paid time off (especially in school holidays), or someone with an interest in working in the catering industry.  The job is fairly physical and you will be on your feet most of the day, but it is a fun and varied place to work - no two days are the same! Due to the location of the school, having access to your own transport would be useful, unless you live in Chilton village - the public transport access is not very good, especially in the evening.",
  "Ad_id": "5411968879",
  "search_keywords": {
    "title": "Kitchen assistant, 18 weeks holiday",
    "location": "Aylesbury, Buckinghamshire"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "MOT TESTER IN WANDSWORTH",
  "location": "Wandsworth, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "10 days ago",
  "Salary": "560",
  "Closes": "13 Jun 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "none": "none",
  "Description": "Experienced Class 4 MOT Tester required for a busy garage in South West London  The applicant must have a valid full UK license with no more than 6 penalty points  Working hours are from 8.30am till 5:30pm Mon-Friday  Saturdays 8.30am to 2:30pm  Extra Hours also available  Competitive rates paid due to experience, MOT with mechanic is a Bonus!!!!  Part Time Vacancy also available  To apply call us on 07968845571",
  "Ad_id": "5411935402",
  "search_keywords": {
    "title": "MOT TESTER IN WANDSWORTH",
    "location": "Wandsworth, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Portsmouth, Hampshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 hour ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038195",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Portsmouth, Hampshire"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Mobile Phone and Computer Repair Technician - Full time / Part Time",
  "location": "Edinburgh",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "7 days ago",
  "Salary": "24.5K-27K + bonuses - FULL TIME",
  "Closes": "16 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Mobile phone repair technician  Hex is currently looking for Full-time / Part-time technicians to join our busy team at our Tollcross Repair Centre.  Hex is the Edinburgh leading smartphone, tablet and computer repair centre running under the same management since established in 2008. We specialise in repairs of all major brands of devices including Apple, Samsung, Huawei and others.  Responsibilities include:  Diagnostic and repairs ( hardware and software ) High standard of customer service ( phone and face to face ) Follow directions from senior technician Follow Health and Safety procedures Promote the brand  Experience required:  Previous experience in repair and diagnostics of Smartphones and Tablets – ( Apple and Android ) Previous experience in repair and diagnostics of Computers ( Mac and PC – laptops and desktops ) Ability to repair most common issues such as screen replacement, battery replacement, charging port repair. Proficiency in soldering and component level repairs – preferred but not essential Attention to detail and high standard of repairs Can do attitude, good teamwork and problem solving abilities. Ability to manage own workload  Hex offers permanent full-time ( 5 days per week ) or part-time positions working between Monday-Sunday.  28 days paid holiday  £24.5-£27K annual salary   bonuses  Please contact Manager by sending your CV at dariusz@hexcs.com.",
  "Ad_id": "5411959220",
  "search_keywords": {
    "title": "Mobile Phone and Computer Repair Technician - Full time / Part Time",
    "location": "Edinburgh"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "COURIER DRIVER",
  "location": "Wirral, Merseyside",
  "Hours": "Part Time",
  "Posted": "1 day ago",
  "Salary": "£20-£40 Per Hour",
  "Recruiter": "Advio",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Sub Contractor",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Job Title: Parcel Delivery Driver  Location: Merseyside  Job Type: Flexible, Part-time/Full-time  Salary: £20-£40 per hour (average pay)  We are currently seeking reliable and motivated individuals to join our team as Parcel Delivery Drivers. As a delivery driver, you will be responsible for delivering parcels to customers in your local area using your own car or van.  Key Responsibilities:  Collecting parcels from the depot and delivering them to customers' addresses Ensuring parcels are delivered on time and in good condition Providing excellent customer service Maintaining accurate records of deliveries made Ensuring that all parcels are delivered safely and securely  Requirements:  A full UK driving license and access to your own car/van Valid Insurance,MOT & Tax A smartphone with GPS capabilities Good communication skills and the ability to provide excellent customer service Flexibility to work on a part-time basis, with the ability to choose your own hours No previous experience required, training will be provided  Benefits:  Bi-weekly pay Pay for each item you deliver Competitive hourly rate, with highly achievable pay rates of £20-£40 per hour Flexible working hours, allowing you to choose when you want to work The ability to go straight home after completing your deliveries, with no need to return to the depot Excellent Work-Life balance  We Have work 7 days a week it's up to you to when you want to work, no commitments!  If you are interested in this exciting opportunity, please apply now via WhatsApp stating your full name,email address and area you wish to work.",
  "Ad_id": "5412026709",
  "search_keywords": {
    "title": "COURIER DRIVER",
    "location": "Wirral, Merseyside"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Part-time - Seasonal Gardener / Allotment Help",
  "location": "Tunbridge Wells, Kent",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "5 days ago",
  "Salary": "to be negotiated",
  "Closes": "19 Jun 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "none": "none",
  "Description": "We have approximately 120 rod of allotment and a small cottage garden which we need help with the digging, sowing, maintenance and general care. I travel a fair amount and want to avoid coming back to a jungle which needs sorting rather than just enjoying the work.  The work would be weekly for a say 7-8 hrs we can be flexible and does not have to be every week. Running upto the winter months there is a lot more work to be done preparing the ground so it could be more hours per week if it is mutually acceptable. Things quieten down for the actual winter months and it maybe it is just a few hours to keep things clean and tidy and preparing for the start of the sowing and planting season in Feb. This is obviously weather dependent when we get into the wetter months. Hourly rate to be discussed.",
  "Ad_id": "5411983886",
  "search_keywords": {
    "title": "Part-time - Seasonal Gardener / Allotment Help",
    "location": "Tunbridge Wells, Kent"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Cleaning services",
  "location": "Lincoln, Lincolnshire",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "2 hours ago",
  "Salary": "13",
  "Closes": "24 Jun 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "none": "none",
  "Description": "Cleaning services  Site cabins  Office Cleaning  Houses  Gardening  Paiyting",
  "Ad_id": "5412038182",
  "search_keywords": {
    "title": "Cleaning services",
    "location": "Lincoln, Lincolnshire"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Temporary summer worker",
  "location": "Aberdeen",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "4 days ago",
  "Salary": "£10.42 per hour",
  "Closes": "20 Jun 2023",
  "Course": "No",
  "Contract Type": "Locum",
  "none": "none",
  "Description": "We are looking for a part time worker with additional hours as needed.  The job is to assist with the extra work for our pest control business. This will be mainly dealing with wasp nest eradication.  The following is essential:  A CLEAN CURRENT driving licence  Ability to learn quickly, training will be given to a satisfactory standard.  Able to use modern technology  Be of smart appearance, uniform will be supplied.  People who are early retired or a student usually suit this vacancy.",
  "Ad_id": "5411986606",
  "search_keywords": {
    "title": "Temporary summer worker",
    "location": "Aberdeen"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Facilities / office manager / administrator",
  "location": "Camden, London",
  "Language": "English",
  "Job Level": "Management",
  "Hours": "Full Time",
  "Posted": "3 days ago",
  "Salary": "£21,000 - £25,000",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We are seeking a facilities manager / administrator.  We are a relaxed, family-owned serviced office centre based in the heart of Primrose Hill, from which about 30 business choose to be located.  As one of two managers, you will be required first and foremost to be a friendly, and welcoming person representing the business to existing and prospective tenants, visitors and contractors.  The role has both administrative (invoicing, accounts, securing new tenants, document management etc) and maintenance (eg basic plumbing, electrical and decorating) facets, with an overarching requirement to be proactive in dealing with matters as they arise.  Some out of hours working may be required  Please send a CV, scan of passport and covering email in the first instance to info@phbcoffices.co.uk",
  "Ad_id": "5411991532",
  "search_keywords": {
    "title": "Facilities / office manager / administrator",
    "location": "Camden, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Live In Housekeeper",
  "location": "Chobham, Surrey",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Upto £42,000 gross pa DOE",
  "Recruiter": "LJW Recruitment",
  "Closes": "22 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Recruiter",
  "Description": "Loving and hands-on family are looking for an exceptional live-in housekeeper with childcare experience; children 2 (g) and 4 (b) years old,  Duties include all household cleaning, ironing and laundry, and helping mum with some childcare duties. Preparing meals mostly for the children and on occasion, for the parents, etc.  The ideal Housekeeper will have clear English skills and able to travel with family worldwide, ideally 3 - 4 weeks. They also spend one-month in USA every year, and you will have that month off as annual leave every summer.  Family are looking for a candidate with 5  years experience who is looking for a long term commitment. Must also have own car for social purposes, as the property is not well connected to public transportation.  Salary / Package:   £36,000 - £42,000 gross pa DOE (£500 - £600 npwk) DOE    28 days paid holiday per annum (bank holidays are worked)    Staff car available for work purposes only - must have own car for social    Lovely private bedroom and shared guest bathroom plus utilities and food provided    Days/Hours:   Monday through Friday approx. 50 hours per week (7am - 7pm with 2 hour break in day)    Plus additional 2 nights per week babysitting.    Ideal start date:   Interviews now / Trial July    Start: Monday 14th of August 2023    Requirements:   Cleaning driving licence and own car    Up to date Enhanced DBS    Valid passport and Right to work in UK    Ideally experienced with special needs    To apply, please email cv along with supporting documentation.",
  "Ad_id": "5412002473",
  "search_keywords": {
    "title": "Live In Housekeeper",
    "location": "Chobham, Surrey"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
  "location": "Bromley, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "8 days ago",
  "Salary": "COMMISSION ONLY JOB",
  "Recruiter": "Avon - Julie Pearce",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay at home mums and dads, students or you in your spare time.  ** IMMEDIATE START **  Part time or Full time  No experience required  Very flexible, work around your family, studies, job etc when you want.  AVON REPRESENTATIVES  Share brochures with friends and family to get orders.  Use the digital brochure links to find customers online. Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you.  OR Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5411946318",
  "search_keywords": {
    "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
    "location": "Bromley, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Cleaning services",
  "location": "Lincoln, Lincolnshire",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "2 hours ago",
  "Salary": "13",
  "Closes": "24 Jun 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "none": "none",
  "Description": "Cleaning services  Site cabins  Office Cleaning  Houses  Gardening  Paiyting",
  "Ad_id": "5412038182",
  "search_keywords": {
    "title": "Cleaning services",
    "location": "Lincoln, Lincolnshire"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Full Time Mechanics - Kensington - Immediate Start - Up To £800/week",
  "location": "Ladbroke Grove, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "3 days ago",
  "Salary": "600 - 800 Per Week",
  "Recruiter": "Jacks Garage",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "Description": "This is an excellent opportunity for an experienced technician, who wants to work in a friendly and enjoyable environment.  We are Jacks Garage (www.jacksgarage.co.uk) London’s premier VW specialists at W10 6SW. A few minutes walk from two underground stations and just of the A40 (Shephards bush) if you drive into work. Official opening hours are 8-6, however some of the lads do extra time from 7-7.  We are recruiting mechanics, panel beaters and all workshop staff with generic skills, focusing mainly on mechanical experience (vehicle maintenance) and body shop panel beaters (welding & metal fabrication).  You must be able to speak, read and write English, does not need to be excellent..  You will have a minimum of 4 years experience in your area of expertise..  This is a very pleasant place to work, everyone is friendly and helpful.  Starting salary depends on experience and skills.  If you have any questions, feel free to call or drop us a line.",
  "Ad_id": "5411991594",
  "search_keywords": {
    "title": "Full Time Mechanics - Kensington - Immediate Start - Up To £800/week",
    "location": "Ladbroke Grove, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Experience Barber",
  "location": "New Cross, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Competitive rates",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Hello all!  We are looking for experienced barbers to come and join us at Chaplins of London. We are based in Deptford, SE8 4PH and are keen to take on an experienced barber/barbers who have a passion for barbering and male grooming.  We are able to offer both full time and part time placements, depending on what will suit you. As well as operating by a very in demand booking system, we also cater for walk in clients so we are a very busy, fast paced establishment.  Ideally we are looking for barbers who have experience in barbering for around 5 years, however depending on your ability we are able to consider a placement for less. You must be able to do the variety of men’s cuts we offer as well as shaves, beard trims and styling.  It’s a fantastic opportunity for the right candidate as we possess the right environment and clientele for you to grow and flourish within the barbering industry.  If you feel you are the appropriate candidate, please don’t hesitate to get in contact on 07752714903 or email us @ info@chaplinsoflondon.com  we Look forward to hearing from you  Chaplins of London",
  "Ad_id": "5412008273",
  "search_keywords": {
    "title": "Experience Barber",
    "location": "New Cross, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Part time cleaners required immediate start in Evesham,Pershore,Droitwich,and Worcester .£12 an hour",
  "location": "Moreton-in-Marsh, Gloucestershire",
  "Hours": "Part Time",
  "Posted": "6 days ago",
  "Salary": "12 an hour",
  "Recruiter": "NATIONWIDE CLEANERS GLOS WARWICK WORCESTERSHIRE LTD",
  "Closes": "18 Jul 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "Recruiter Type": "Recruiter",
  "none": "none",
  "Description": "Cleaners are required for domestic cleaning work in Evesham, Pershore, Droitwich, Worcester,Bidford on Avon, Stratford upon Avon and surrounding areas  Reliable, punctual, and conscientious.  Drivers with the use of cars are ideal ..You must have a car unless you live locally  Part-time, Daytime-Weekdays  dusting and polishing furniture.  vacuuming/cleaning carpets.  mopping floor tiles.  Good interpersonal and communication skills",
  "Ad_id": "5411976393",
  "search_keywords": {
    "title": "Part time cleaners required immediate start in Evesham,Pershore,Droitwich,and Worcester .£12 an hour",
    "location": "Moreton-in-Marsh, Gloucestershire"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "RECEPTIONIST/ADMINISTRATOR IN WANDSWORTH",
  "location": "Putney, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "10 days ago",
  "Salary": "18000-20000",
  "Closes": "13 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We are looking for an office administration assistant to work 5 days a week Mon-Fri 8:30am-4:30pm. The role will include booking appointments plus answering the phone calls, dealing with customers over and phone and face to face responding to client enquiries, job scheduling, making estimates, invoicing and other administrative duties. Good MS Office skills are required with a friendly and customer-oriented attitude. A good standard of numeracy and spoken English would be be necessary to fulfil the role. The successful candidate will have flexibility and be able to adapt quickly to changing priorities. Highly organised and self-motivated. Salary would be commensurate with role and experience.  All necessary training relating to the industry will be provided.",
  "Ad_id": "5411935377",
  "search_keywords": {
    "title": "RECEPTIONIST/ADMINISTRATOR IN WANDSWORTH",
    "location": "Putney, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Labourers Wanted Urgently",
  "location": "Cullompton, Devon",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "3 days ago",
  "Salary": "12 per hour",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Wanted urgently a labourers with CSCS card.  Light labouring Job  PPE will be provided.  Good rate  Immediately Start.",
  "Ad_id": "5411989955",
  "search_keywords": {
    "title": "Labourers Wanted Urgently",
    "location": "Cullompton, Devon"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Multi Drop Driver",
  "location": "Bootle, Merseyside",
  "Hours": "Part Time",
  "Posted": "1 day ago",
  "Salary": "£20-£40 Per Hour",
  "Recruiter": "Advio",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Sub Contractor",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Job Title: Parcel Delivery Driver  Location: BOOTLE  Job Type: Flexible, Part-time/Full-time  Salary: £20-£40 per hour (average pay)  We are currently seeking reliable and motivated individuals to join our team as Parcel Delivery Drivers. As a delivery driver, you will be responsible for delivering parcels to customers in your local area using your own car or van.  Key Responsibilities:  Collecting parcels from the depot and delivering them to customers' addresses Ensuring parcels are delivered on time and in good condition Providing excellent customer service Maintaining accurate records of deliveries made Ensuring that all parcels are delivered safely and securely  Requirements:  A full UK driving license and access to your own car/van Valid Insurance,MOT & Tax A smartphone with GPS capabilities Good communication skills and the ability to provide excellent customer service Flexibility to work on a part-time basis, with the ability to choose your own hours No previous experience required, training will be provided  Benefits:  Bi-weekly pay Pay for each item you deliver Competitive hourly rate, with highly achievable pay rates of £20-£40 per hour Flexible working hours, allowing you to choose when you want to work The ability to go straight home after completing your deliveries, with no need to return to the depot Excellent Work-Life balance  We Have work 7 days a week it's up to you to when you want to work, no commitments!  If you are interested in this exciting opportunity, please apply now via WhatsApp 07497 608 909 stating your full name,email address and area you wish to work.",
  "Ad_id": "5412026721",
  "search_keywords": {
    "title": "Multi Drop Driver",
    "location": "Bootle, Merseyside"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Calling on Mrs Doubtfire! Nanny-housekeeper position in Chelsea from early-mid June",
  "location": "Central London, London",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "11 days ago",
  "Salary": "£50,000+ per annum",
  "Closes": "12 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We are a family with two working parents and two children aged 10 and 8. After years of great nanny support my husband and I are ready for some all-round family and household support and looking for that loving additional member of the family! Ideally you don’t live too far away (we are in Chelsea, off King’s Road), can be with us for 7.30am in the morning to help get the children ready for school and walk them there, then do some housework and cleaning for ~3 hours each day (you need to love cleaning but for the ironing we do have additional help already); we are then pretty flexible for you to have some break-time until the children need to be picked up (around 3.30/4pm) and your day would finish usually at 6.30pm. On some evenings we would need you to have the flexibility to stay a bit longer if we both have an evening engagement. There might also be the odd overnight stay. During half term and holidays we would need you to be with the children full-time but again if they have some days or half-days at a sports camp there will be some down-time. Our children are funny and engaging; on the whole they are self-starters but still need a bit of encouragement and oversight when doing their homework. As they grow to be teenagers we suspect their appetite will increase so if you like cooking that’s a bonus. Maybe you are a mother of slightly older children yourself and would enjoy the challenge? Depending on experience we are happy to pay £50k  gross per year. Please send us your application/ CV and confirm you have relevant references if this position is of interest.",
  "Ad_id": "5411929412",
  "search_keywords": {
    "title": "Calling on Mrs Doubtfire! Nanny-housekeeper position in Chelsea from early-mid June",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Parts Advisor",
  "location": "Leighton Buzzard, Bedfordshire",
  "Hours": "Full Time",
  "Posted": "13 days ago",
  "Salary": "Salary from £25,000 per annum, negotiable based on experience",
  "Recruiter": "Avery's Garage and Transport",
  "Closes": "08 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Could you be our client’s next Parts Advisor? If you have previous experience in the motor vehicle industry, this role working for a family business in Leighton Buzzard could be perfect for you – apply today!  Parts Advisor  Leighton Buzzard, LU7 4SQ  Monday to Friday, 7:30am – 5:30pm, permanent Salary from £25,000 per annum, negotiable based on experience  Please Note: Applicants must be authorised to work in the UK  Our client, a leading commercial vehicle accident repair centre based in Leighton Buzzard, is seeking an experienced Parts Advisor to join their team. With a modern purpose-built site for car, van, truck & coach repairs, the company is committed to delivering exceptional service to their customers.  About the role:  As a Parts Advisor, you will be responsible for the following duties:  Identifying and ordering parts for vehicles Checking parts upon delivery for accuracy and quality Ensuring correct disposal of old or unused parts in accordance with regulations Arranging return of parts and monitoring credits Processing supplier invoices on management system Working closely with technicians and estimators to assess vehicles and parts lists Using Autoflow and Audatex systems to manage parts inventory  About you:  The ideal candidate will have the following qualifications and experience:  Previous experience in the motor vehicle industry with a good understanding of vehicle parts and processes Ability to work in a fast-paced environment and handle multiple tasks Strong attention to detail and organisational skills Excellent communication and interpersonal skills Proficiency in using Autoflow and Audatex systems to manage parts inventory  Benefits:  In addition to competitive remuneration, our client offers a great working environment and long-term career prospects.  If you are interested in this role and meet the requirements, don’t hesitate to apply.  How to apply for the role:  If you have the skills and experience required for this position, click “apply” today and check your inbox for an email providing more information on how to tailor your application and provide a cover letter or any supporting documents.  You must be authorised to work in the UK. No agencies please.  Flat Fee Recruiter is an advertising agency promoting this role on behalf of the employer. You will be contacted directly by the employer and not Flat Fee Recruiter should they wish to move forward with your application.  Other suitable skills and experience include Automotive, Motor Trade, Parts Advisor, Car Parts Advisor, Vehicle Parts Advisor, Motor Parts Advisor, Parts Worker, New Parts Advisor, Audatex, AutoFlow",
  "Ad_id": "5411906144",
  "search_keywords": {
    "title": "Parts Advisor",
    "location": "Leighton Buzzard, Bedfordshire"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Northampton, Northamptonshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 hour ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038197",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Northampton, Northamptonshire"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Live in Bar Staff",
  "location": "Bromley, London",
  "Language": "English",
  "Hours": "Full Time",
  "Posted": "3 days ago",
  "Salary": "on interview",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We are looking for a live in bar staff. Experience is not essential but preferred There will be full inhouse training for all aspects of the job .We are a family run traditional pub which is very sports lead. We are looking for someone to add to a very well established team..",
  "Ad_id": "5411991487",
  "search_keywords": {
    "title": "Live in Bar Staff",
    "location": "Bromley, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Nanny/Housekeeper/Cook Full time live in/out start ASAP",
  "location": "Swiss Cottage, London",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "12 days ago",
  "Salary": "negotiable",
  "Closes": "12 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Nanny-Housekeeper-Cook required for friendly family of 3!  We are looking for a educationally focussed, trustworthy, honest and reliable live-out/live-in Nanny-Housekeeper-Cook  Start as soon as possible.  Hours/days: Monday to Friday. 12pm-8pm (live in slightly different times) Satudays if wished.  Duties will include: school pick ups, bedtime routines, cooking simple healthy meals for the family, ironing, laundry, dusting, hoovering, mopping floors, care/polishing of fine ornaments, food shopping, making beds, changing linen, bathrooms, monitoring cleaning supplies and communicating when these run low, communicating any necessary repairs to us etc  Character: cheerful, hardworking, efficient, able to manage stairs comfortably , good manners, cleaning to a high standard, active, fluent English, can follow instructions clearly for cleaning delicate materials, washing instructions, recipes and communicates well.  Salary: Competitive for the right applicant.  Please attach your most up to date CV, references and a recent photo. Thank you!",
  "Ad_id": "5411929023",
  "search_keywords": {
    "title": "Nanny/Housekeeper/Cook Full time live in/out start ASAP",
    "location": "Swiss Cottage, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Window fitters",
  "location": "Bromley, London",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "2 days ago",
  "Salary": "dependant on experience",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Family-run glazing business based in Westerham requires a reliable, experienced window fitter (or team)for immediate start.  Must be professional, able to measure and fit UPVC windows and doors to a high standard, and undertake repairs where required.  Essential requirements: full clean driving licence valid in UK, ability to work on own initiative, attention to detail.  Monday to Friday 08:00-17:00, Excellent rates for the right person/team and overtime available if wanted.  Just taken on a 5 year contract in Guildford area.  Please call our office 01959 571200 and ask to speak to Bob or email rstglassandglazing@live.co.uk  Job Type: Full-time",
  "Ad_id": "5412000298",
  "search_keywords": {
    "title": "Window fitters",
    "location": "Bromley, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Associate Dentist – Full Time - Kilwinning Dental Care, Ayrshire - near Glasgow",
  "location": "Glasgow",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "4 hours ago",
  "Salary": "Highly competitive",
  "Recruiter": "Clyde Dental Practice Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "We are currently seeking an Associate Dentist to join our practice in Kilwinning Dental Care, Ayrshire. This is a small, modern practice, with mixed NHS and private patients. It is easily accessible from Glasgow and the surrounding area, with free parking available. You will working alongside a very experienced team.  The successful candidate can enjoy the following:  Clinical Support and Bespoke Career Development Plan A generous working pattern Software of Excellence Strong admin support from our wonderful and welcoming team! Dental Scrubs will be provided.  What are we looking for?  A desire and passion to provide a high level of clinical care. The ability to work well within a team. A passion for continuous professional development is essential. Experience of Software of Excellence (SOE) practice software is preferable. GDC registration and VT number are essential.  Benefits of working within the Clyde Munro Dental Group:  Clyde Munro Mentoring Scheme and bespoke Career Development Pathway Clyde Munro Associate Conference held annually. Digital Dentistry Great clinical freedom and support. Fully trained team.  Overseas Applicants:  Clyde Munro welcomes applications from overseas dentists. Visa sponsorship is available and will be discussed in detail with successful applicants to support each candidates’ specific requirements.",
  "Ad_id": "5412037962",
  "search_keywords": {
    "title": "Associate Dentist – Full Time - Kilwinning Dental Care, Ayrshire - near Glasgow",
    "location": "Glasgow"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Courier / Multi-drop Delivery Driver for Amazon BOW",
  "location": "Docklands, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "£870.00-£1,188.00 per week",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "Welcome to Network Global Holdings  We are looking for Multi- Drop Delivery Drivers to join our vibrant team. We currently have several vacancies in multiple locations! Are you looking for a job that offers flexibility, security, and a happy work environment.  NO EXPERIENCE IS NEEDED  Job Description for Multi-Drop Delivery Driver:  Deliver a number of parcels (all shapes and sizes) to our customers (residential commercial locations) following a sequenced route  What we Require:  Multi-drop experience (not essential) Full UK Driving Licence held for at least 2 years and with no more than 6 points ID /Passport/RTW/UK Settlement Status (if required) National insurance number Proof of address (within 3 months) UTR (unique tax reference number). We can guide you on how to make an application should you not have one. Criminal background checks performed Able to pass a Drug & Alcohol Test (if required) We also accept owner drivers, but you must be courier insured together with Goods in Transit and Public liability  What we can offer you:  As Multi-Drop Delivery Driver, you can get up to:  - SWB - £145.00 x 6 Days = £870.00   20% VAT = £1044.00*  - LWB - £165.00 x 6 Days = £990.00   20% VAT = £1,188.00*  6 days per week, with working up to 6 days a week, including weekends and bank holidays Daily Bonus during Christmas/busy period Weekly payment Flexible Schedule Self-employed contract 12 days of paid training with reduces routes on 8 of the 12 days Assistance with van rental and no upfront cost to you Fuel Refund per delivery mileage included Phone bill support (£1.80/day) included Routes already in sequence The route will be pre-loaded and ready for you to load and go. Immediate start available Possible extra service payments Weekly bonuses Family & Friend Referral schemes available  To discuss an immediate start for Multi-Drop Delivery Driver, please click below.",
  "Ad_id": "5412019936",
  "search_keywords": {
    "title": "Courier / Multi-drop Delivery Driver for Amazon BOW",
    "location": "Docklands, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Delivery driver",
  "location": "Barking, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "5 days ago",
  "Salary": "Up to 30,000+Bonuses+Benefits",
  "Closes": "19 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Packs N Boxes - WE ARE HIRING!  WHO ARE WE -  At PXB there’s more to being a multi drop driver than simply sitting behind a wheel.  As one of our delivery partners you’ll be the face of our franchise (3rd party distribution on behalf of DPD)for the multiple diverse customers you meet on a daily basis.  OVERVIEW -  Being a multi drop delivery driver is a demanding and fast paced role, you will be spending much of the working day alone. You will be shown our processes with specialised training and with our dedicated team always being at the end of the line. We want you to succeed as we succeed!  BASIC REQUIREMENTS -  - Full driving license (no more than 6 points)  - Passport / right to work in the UK document  - Proof of NI number  - DBS check (at your cost, link provided)  - Proof of CURRENT address  PXB ADDITIONAL REQUIREMENTS -  - we are seeking money motivated, reliable and driven candidates with the willingness to go the extra mile for the company and the customers we serve.  - Someone that is prepared to work throughout all weather conditions, with a “can do” attitude, and a friendly personality to offer the customers excellent service.  - First class customer service skills  - Reliable / Trustworthy  - Flexibility to work  - Ability to work alone  - Ability to work under pressure  WHAT WE OFFER -  - Full on the road training, driving experience required but not essential.  - Full uniform provided (excluding safety boots)  - Company vehicle & insurance covered by the company  - Competitive rates  - Monthly pay  - Bonuses (performance related)  If you feel you could fulfil this role to its full potential please apply today, by contacting Dee on 07934990190.  We look forward to hearing from you.  PXB  Packs N Boxes  - Location : DPD Barking depot  - Contract type : Permanent  - SELF EMPLOYED  - Working start times between 5am - 8am (depending on route allocated)  Benefits:  Uniform provided Company car Flexitime On-site parking",
  "Ad_id": "5411983575",
  "search_keywords": {
    "title": "Delivery driver",
    "location": "Barking, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
  "location": "Belfast",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "20 hours ago",
  "Salary": "£50 - £500 per week",
  "Recruiter": "Avon cosmetics",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay-at-home mums and dads, students, or you in your spare time.  ** IMMEDIATE START **  No experience required  AVON REPRESENTATIVES  work from home sharing your digital link to products to get orders, and earn commission from the sales.  share digital brochure links to find customers online. using facebook and Instagram, whatsapp, etc.  Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you and you earn from those orders.  OR  Share brochures with friends and family to get orders.  Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5412033302",
  "search_keywords": {
    "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
    "location": "Belfast"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Carpenters - Refurbishments and new build projects - New Forest & surrounding area",
  "location": "Ringwood, Hampshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "22 hours ago",
  "Salary": "up to £40,000 per annum + 20 days paid holidays + bank holidays, mileage allowance",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Carpenters for Colten Developments Ltd  Colten Developments Ltd are looking to recruit skilled Carpenters to work on our refurbishment and enhancement projects within our portfolio of properties located in and around Bournemouth, Poole, Ferndown, Lymington, New Milton and surrounding areas.  This role requires you to be on the tools working closely with other trades persons on projects across the Colten Group. These projects will range in value from £500 to £500,000 in value.  Good communication skills and ability to read and understand drawings are essential for this key role within the business. Previous experience working on refurbishment projects is preferable.  The successful candidate will be required to complete a DBS check. This position will require you to provide your own van/car to travel between various locations.  send a copy of your current C/V to johnbugler@colten.co.uk",
  "Ad_id": "5412031245",
  "search_keywords": {
    "title": "Carpenters - Refurbishments and new build projects - New Forest & surrounding area",
    "location": "Ringwood, Hampshire"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Night driver",
  "location": "Croydon, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "6 days ago",
  "Salary": "500",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Night delivery driver 6 days a week £500 a week clear will be delivery to different cafes and shops",
  "Ad_id": "5411969439",
  "search_keywords": {
    "title": "Night driver",
    "location": "Croydon, London"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Chez jules waiting staff",
  "location": "Edinburgh",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "4 days ago",
  "Salary": "hourly pay",
  "Closes": "20 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Oui, oui, oui, Hurrah! Busy bistro Chez Jules is again looking for staff either full time or part time. If you are keen to work, modern, enthusiastic, competent, full of life and want to join a great team that never gives up then you should absolutely apply. Speaking French is good but not essential but you must have some experience in busy places. You must also like working as part of an efficient and successful team of course. Finally if you like noise, a buzzing and electric atmosphere, great food and fantastic customers... Then you should email us a CV including a recent photo. Hourly pay, gratuities, training and holidays are all part of the package.",
  "Ad_id": "5411985312",
  "search_keywords": {
    "title": "Chez jules waiting staff",
    "location": "Edinburgh"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "BRICKLAYERS REQUIRED",
  "location": "Chelmsford, Essex",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "21 hours ago",
  "Salary": "WEEKLY PAID",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "IMMEDIATE START FOR EXPERIENCED BRICKLAYERS FOR A SITE IN LATCHINGDON = CM3 6LJ  MUST HOLD A CURRENT CSCS CARD  OWN TRANSPORT REQUIRED  CURRENT RATE OF £230.00 PER DAY  PLEASE CONTACT BEN ON 07738043737 OR THE OFFICE ON 01621857182",
  "Ad_id": "5412031427",
  "search_keywords": {
    "title": "BRICKLAYERS REQUIRED",
    "location": "Chelmsford, Essex"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Chef de Partie",
  "location": "Llandaff, Cardiff",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "22 hours ago",
  "Salary": "£23,920 SALARIED, Sick Pay, Holiday Pay, Pension, Free Lunches & Onsite Car Park",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "ROLE  Chef de Partie  To join a small dynamic team to deliver a cafe menu and onsite hospitality  KEY RESPONSIBILITIES  Our Chef de Partie will report to the Senior Chef. The role is made up of many varying responsibilities including:  Preparing, cooking, and presenting high quality dishes Assisting the Senior Chef in creating menu items, recipes, and developing dishes Preparing meat and fish Prepare to order Assisting with the management of health and safety Assisting with the management of food hygiene practices Monitoring portion and waste control Overseeing the maintenance of kitchen and food safety standards  Candidates should be able to demonstrate the following:  Essential  To land our chef position you will need:  Level 1 and 2 Food Safety Awards Minimum 2-3 year’s relevant experience Awareness of manual handling techniques Awareness of Control of Substances Hazardous to Health Regulations (COSHH) and chemical safety Experience of kitchen equipment Experience of dangerous equipment such as knives Ability to work in an environment which can be pressured at times Good communication skills (an understanble level of English spoken and written) Have a good head for figures Excellent planning and organisational skills High level of attention to detail Cooperative teamworking skills Ability to work without close supervision Ability to produce good quality food in all sections Enthusiasm to develop your own skills and knowledge plus those around you Adaptability to change and willingness to embrace new ideas and processes Positive and approachable manner  Desirable and useful but not necessary qualifications include:  Level 2 Health and Safety in the Workplace Award Level 3 Food Safety Awards Previous corporate or event experience Ability to speak Welsh Experience in event catering Team player qualities Experience of heritage or cultural organisations  Benefits:  Sick pay, Pension, Holiday Pay, Onsite Parking, Free Lunches",
  "Ad_id": "5412030832",
  "search_keywords": {
    "title": "Chef de Partie",
    "location": "Llandaff, Cardiff"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
  "location": "Bristol City Centre, Bristol",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "9 days ago",
  "Salary": "COMMISSION ONLY JOB",
  "Recruiter": "Avon - Julie Pearce",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay at home mums and dads, students or you in your spare time.  ** IMMEDIATE START **  Part time or Full time  No experience required  Very flexible, work around your family, studies, job etc when you want.  AVON REPRESENTATIVES  Share brochures with friends and family to get orders.  Use the digital brochure links to find customers online. Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you.  OR Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5411945342",
  "search_keywords": {
    "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
    "location": "Bristol City Centre, Bristol"
  }
},{
  "timestamp": "25/05/2023 18:26:50",
  "title": "Multi Drop Driver",
  "location": "Kirkby, Merseyside",
  "Hours": "Part Time",
  "Posted": "1 day ago",
  "Salary": "£20-£40 Per Hour",
  "Recruiter": "Advio",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Sub Contractor",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Job Title: Parcel Delivery Driver  Location: KIRKBY  Job Type: Flexible, Part-time/Full-time  Salary: £20-£40 per hour (average pay)  We are currently seeking reliable and motivated individuals to join our team as Parcel Delivery Drivers. As a delivery driver, you will be responsible for delivering parcels to customers in your local area using your own car or van.  Key Responsibilities:  Collecting parcels from the depot and delivering them to customers' addresses Ensuring parcels are delivered on time and in good condition Providing excellent customer service Maintaining accurate records of deliveries made Ensuring that all parcels are delivered safely and securely  Requirements:  A full UK driving license and access to your own car/van Valid Insurance,MOT & Tax A smartphone with GPS capabilities Good communication skills and the ability to provide excellent customer service Flexibility to work on a part-time basis, with the ability to choose your own hours No previous experience required, training will be provided  Benefits:  Bi-weekly pay Pay for each item you deliver Competitive hourly rate, with highly achievable pay rates of £20-£40 per hour Flexible working hours, allowing you to choose when you want to work The ability to go straight home after completing your deliveries, with no need to return to the depot Excellent Work-Life balance  We Have work 7 days a week it's up to you to when you want to work, no commitments!  If you are interested in this exciting opportunity, please apply now via WhatsApp 07497 608 909 stating your full name,email address and area you wish to work.",
  "Ad_id": "5412026727",
  "search_keywords": {
    "title": "Multi Drop Driver",
    "location": "Kirkby, Merseyside"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Personal Assistant (PA) to Young Disabled Man",
  "location": "Gorgie, Edinburgh",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "8 days ago",
  "Salary": "£13.00 per hour",
  "Closes": "15 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "As a Personal Assistant (PA), your role is to enable the employer, a young disabled man and powerchair user, to be as independent as possible. This vacancy is only open to holders of a driving licence valid in the UK, unless working evening or night shift.  Key Responsibilities  Assist the employer with a wide range of social, work-related and domestic activities, including driving the employer’s Wheelchair Accessible Van (WAV). Assist the employer with cleaning, laundry, shopping and administrative tasks. Assist the employer with eating, drinking, preparing and cooking food. Assist the employer with dressing, showering and toileting, including use of a hoist. Assist the employer to be comfortable in bed overnight, repositioning him on request.  Skills & Personal Qualities  Enthusiastic, outgoing and positive attitude. Excellent communication and interpersonal skills. Excellent time-management and organisational skills. Previous experience supporting a disabled person and awareness of the Social Model of Disability is essential. Driving licence valid in the UK is essential. Protecting Vulnerable Groups (PVG) scheme membership is essential.  Additional Information  Opportunity is open to male and female applicants of all backgrounds. Employment is dependent upon the successful completion of paid trial period with training. Staff room available for taking rest breaks or supporting employer overnight.",
  "Ad_id": "5411945719",
  "search_keywords": {
    "title": "Personal Assistant (PA) to Young Disabled Man",
    "location": "Gorgie, Edinburgh"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Charity Fundraiser - Commission based Earn up to £14ph",
  "location": "Camden, London",
  "Language": "English",
  "Hours": "Full Time",
  "Posted": "10 days ago",
  "Salary": "Commission based, earn up to £14ph",
  "Recruiter": "Make It Count",
  "Closes": "14 Jul 2023",
  "Course": "No",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "We are now recruiting for a Charity Fundraiser with an immediate start.  ** AVAILABLE - TEMP WORK, FULL TIME or PART TIME ** FLEXIBLE HOURS ** ALL CANDIDATES MUST BE 18 OR OVER, LIVE IN THE UK AND ABLE TO COMMUTE TO OUR LONDON OFFICE DAILY!  Make it Count is an established company in the heart of London, with a high reputation and recognition for the services we provide to our clients & community. This is a field-based vacancy so you must be able to travel daily! We cover areas of London, Kent & Essex.  The role is to promote our clients by raising awareness of their activities by fundraising at pre-arranged supermarkets/shopping centres/train stations etc.  Our company is expanding non-stop so we are employing talented well-spoken Sales Representatives who can uphold our company’s culture and vision.  You must be able to speak fluent English, if you can speak more languages even better! You must be able to provide proof of ID and Residence to be considered for the role.  Experience is not necessary as we provide full product training, just need a willingness to learn! We welcome candidates with previous experience in Sales, Customer Service, Call Centre, Hospitality or Marketing.  You must be presentable with a smart appearance and very approachable!  We provide:  Full training for newbies and refresher course for the experienced  All marketing materials and equipment are provided including charity issued card machines for contactless donations  Benefits for you include:  *** paid 40% commission, also weekly bonuses for the super seller...!!! ***  *** Paid Cash Daily ***  *** Full Training and Support given by experienced trainers who have 20  years experience ***  *** A Buzzing Fun Fast Paced Environment ***  Immediate Start - CASH IN HAND DAILY - ***CALLING ALL TRUE SALES REPS TO APPLY NOW***  WHATSAPP the words ''PINK FUNDRAISER'' to 07554 473 709 to arrange to come to our Head Office in Whitechapel E1 6TD for your interview and to be registered. Please only contact between 10am till 6pm.  PLEASE ENSURE YOU ARE FLUENT IN ENGLISH & THAT YOU ARE A UK CITIZEN. Please bring proof of ID and Residence when you come to the office and also a bag e.g rucksack or holdall bag to carry your fundraising equipment in to start work that day or the following day if you are successful.  *** We will look forward to hearing from you! Apply today ***",
  "Ad_id": "5411937068",
  "search_keywords": {
    "title": "Charity Fundraiser - Commission based Earn up to £14ph",
    "location": "Camden, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Barber",
  "location": "Orpington, London",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "7 days ago",
  "Salary": "£120+ per day (Dependent of Speed and Quality of Hair Cuts)",
  "Closes": "16 Jun 2023",
  "Course": "No",
  "none": "none",
  "Description": "Experienced Barber Wanted - Must be able to work with all hair types and styles.",
  "Ad_id": "5411964132",
  "search_keywords": {
    "title": "Barber",
    "location": "Orpington, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Dental Nurse (Trainee or Qualified)",
  "location": "Ilford, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "6 days ago",
  "Salary": "Minimum wage to £12/hr",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Ilford Dental Care is looking for an experienced dental nurse to join a well established private practice in Ilford, London.  Role Details:  ·Start ASAP  ·Part-time & Full time position  · Monday - Friday; 09:00 - 18:00  · Saturday: 09:00 - 13:00  .Dental Nurse Duties  ·Performing high quality reception and administration tasks, maintain productive working relationships with all members of the dental team.  ·Pearl Dental Software  About the practice:  ·Friendly and welcoming small team  .Work as a team to complete daily tasks  ·Private Practice offers Invisalign, Dental Implants, cosmetic dentistry  ·Local transport links  ·Fully computerised / digitalised  Requirements:  ·Dental Nurse Qualification (GDC Registered)  ·Confident and be able to work with different people within the team on a daily basis  ·Great organisational & communicational skills  ·Very well spoken English  Salary:  Qualified - from £12/hr depending on experience  If you think you are the right candidate for this job please send your CV  Job Types: Full-time, Part-time  Salary: From £12.00 per hour",
  "Ad_id": "5411968129",
  "search_keywords": {
    "title": "Dental Nurse (Trainee or Qualified)",
    "location": "Ilford, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Tyne and Wear",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 hour ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week! If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038191",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Tyne and Wear"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Aberdeen",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 hour ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038190",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Aberdeen"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Weekend dog sitter",
  "location": "Ladbroke Grove, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "15 hours ago",
  "Salary": "£30 per day",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "Demanding shihtsu that needs to be cared for in her home in W10. Half day each Saturday and Sunday. Walk in Hyde Park plus lots of attention and care needed. Dog lovers apply.",
  "Ad_id": "5412035676",
  "search_keywords": {
    "title": "Weekend dog sitter",
    "location": "Ladbroke Grove, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Sheffield, South Yorkshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038178",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Sheffield, South Yorkshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Experienced Mechanic wanted in Barnet EN4 Hugh Earning potential",
  "location": "Barnet, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "8 days ago",
  "Salary": "£32,000 +PER Annum + PERKS",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Mobile Mechanics and Tyres  We are a Small Established independent garage based in New Barnet. We repair all makes of Cars and Vans . We urgently seek an experienced technician due to the rapidly growing volume of work ie Engine Changes,Clutches,Cambelts,Electricial testing,Fault Finding,Suspension,Brakes,License.  This is ideally suited to someone with all round experience, who is qualified and is hungry to improve their earnings.  You must be able to work independently and as part of a team Dedicated to customer satisfaction through quality of service and attention to detail. Salary is £28,000 - £31,000 Per Annum Plus Lunch and Overtime. Depending on Experience. Experience must be a minimum of 5 years within the trade and has continuously developed their skills throughout this time and must be able to do all cambelts & chain kits. I dont want someone who has'nt been in the trade for years and now wants to come back in  FULL DRIVING LICENSE is a must  Mechanic Has to have Basic tools like a Socket set a light  We look foward to hearing from you.  To find out more and to arrange to meet call Inderjit 0778 99 343 55",
  "Ad_id": "5411946097",
  "search_keywords": {
    "title": "Experienced Mechanic wanted in Barnet EN4 Hugh Earning potential",
    "location": "Barnet, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Scotland - Live-In Housekeeper - 28K",
  "location": "Edinburgh",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 days ago",
  "Salary": "£28,000",
  "Recruiter": "Knightsbridge Household Staff",
  "Closes": "21 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Recruiter",
  "Description": "Stunning Scotland - Live-In Housekeeper - 28K (2 Bed House & Bills included)  We are looking to hire a Live-In Housekeeper to work in the Border of Scotland, based on a shooting lodge for a VIP family.  You will work alongside a Housekeeper/Cook with a Junior Cleaner reporting into you.  This job comes with separate 2 bed cottage, all expenses paid. Family members/pets welcome to join.  The housekeeper is required to work 8am to 4pm, 5 days on and 2 days off generally, Mon – Fri but be prepared to work longer hours when principals are in residence. This is a holiday home, used mostly during the 2nd part of the year.  Ideally suit an experienced housekeeper from a chalet/hotel background, ideally with some private household experience, looking to secure a long-term role, working in a stunning but remote location.  All housekeepers applying must have excellent cleaning and laundry skills, be able to implement a cleaning schedule, confident managing a junior cleaner.  All housekeepers applying must be drivers with their own cars  We look forward to receiving your CV.",
  "Ad_id": "5411991720",
  "search_keywords": {
    "title": "Scotland - Live-In Housekeeper - 28K",
    "location": "Edinburgh"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Housekeeper/Aupair",
  "location": "London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Part Time",
  "Posted": "2 hours ago",
  "Salary": "To be agreed",
  "Closes": "24 Jun 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "none": "none",
  "Description": "Free flat in lovely Wimbledon home in return for dog walking and some housework.  Must be able to start immediately.  Please send CV and recent photo.",
  "Ad_id": "5412038050",
  "search_keywords": {
    "title": "Housekeeper/Aupair",
    "location": "London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "HGV 2 Commercial Tradewaste Driver",
  "location": "Central London, London",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 days ago",
  "Salary": "Negotiable",
  "Recruiter": "Corus Consultancy Ltd",
  "Closes": "29 May 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "Recruiter Type": "Direct Employer",
  "Description": "We are currently looking for a HGV2 driver to work for a waste collecting company based in the SE1 area.  You will be going out in a dustcart lorry collecting waste from commercial properties. This is a driver loader position so manual work will be required. A loader may also be provided to help.  This is a Monday to Friday role and weekends are optional.  Hours of work: 3am - 11am or 3pm - 11pm  You must hold a HGV2 licence, CPC card and Tacho Card.  Newly passed drivers are happily accepted too.  If you are interested in this role and would like find out more please give Tracey a call.",
  "Ad_id": "5411993754",
  "search_keywords": {
    "title": "HGV 2 Commercial Tradewaste Driver",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Courier / Multi-drop Delivery Driver for Amazon West Thurrock",
  "location": "Grays, Essex",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "£870.00-£1,188.00 per week",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "Welcome to Network Global Holdings  We are looking for Multi- Drop Delivery Drivers to join our vibrant team. We currently have several vacancies in multiple locations! Are you looking for a job that offers flexibility, security, and a happy work environment.  EXPERIENCE IS NEEDED  Job Description for Multi-Drop Delivery Driver:  Deliver a number of parcels (all shapes and sizes) to our customers (residential commercial locations) following a sequenced route  What we Require:  Multi-drop experience Full UK Driving Licence held for at least 2 years and with no more than 6 points ID /Passport/RTW/UK Settlement Status (if required) National insurance number Proof of address (within 3 months) UTR (unique tax reference number). We can guide you on how to make an application should you not have one. Criminal background checks performed Able to pass a Drug & Alcohol Test (if required) We also accept owner drivers, but you must be courier insured together with Goods in Transit and Public liability  What we can offer you:  As Multi-Drop Delivery Driver, you can get up to:  - SWB - £145.00 x 6 Days = £870.00   20% VAT = £1044.00*  - LWB - £165.00 x 6 Days = £990.00   20% VAT = £1,188.00*  6 days per week, with working up to 6 days a week, including weekends and bank holidays Daily Bonus during Christmas/busy period Weekly payment Flexible Schedule Self-employed contract 12 days of paid training with reduces routes on 8 of the 12 days Assistance with van rental and no upfront cost to you Fuel Refund per delivery mileage included Phone bill support (£1.80/day) included Routes already in sequence The route will be pre-loaded and ready for you to load and go. Immediate start available Possible extra service payments Weekly bonuses Family & Friend Referral schemes available  To discuss an immediate start for Multi-Drop Delivery Driver, please click below.",
  "Ad_id": "5412019723",
  "search_keywords": {
    "title": "Courier / Multi-drop Delivery Driver for Amazon West Thurrock",
    "location": "Grays, Essex"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "chef de partie",
  "location": "Shoreditch, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 days ago",
  "Salary": "Competitive pay",
  "Recruiter": "The English Restaurant/MarketCoffeeHouse&Bar",
  "Closes": "21 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "Chef de PARTIE, Shoreditch E1. We need your skills, creativity and enthusiasm! With scope for originality, that only a truly independent restaurant can offer, we are looking for someone to share our passion for fresh, seasonal and local produce.  As Chef de Partie, in our kitchen you will be part of a small team cooking from scratch with fresh produce from our excellent suppliers. There will be lots of opportunity for career progression for the right sort of person. Expect to be working 45-48 hours a week. Although we do have availability for a position with fewer hours, at an hourly rate.  We can offer a stable workplace, where your efforts will be appreciated, and excellent working conditions. The pay package on offer is attractive, based on a salary with a generous share of Tronc. Monthly pay, with no acceptions. Pay to be determined at interview, on the basis of experience.  Full eligibility to work in the UK is essential, as are strong communication and people skills. HACCP knowledge is a must. Real knowledge and a love of food would also be very welcome.",
  "Ad_id": "5411993114",
  "search_keywords": {
    "title": "chef de partie",
    "location": "Shoreditch, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Dental Reception/Administrator",
  "location": "Palmers Green, London",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "£18,000-£21,000",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Job description  Dental Receptionist/ Administrator  Motto “Don’t worry, leave it with me, I’ll get it sorted”  The successful applicant will benefit from:-  an attractive salary  a modern and spacious working environment  a commitment to CPD and team training  a forward thinking principal and team  a fantastic, modern working environment  Job description:  Managing Director of First impressions  Convert enquiries into appointments as appropriate – we want to carry out some strategic marketing to attract New and Existing patients back. And your job will be to receive these enquiries (emails, telephone, social media, messaging, walk ins) and arrange appointments as appropriate for that patient.  Help with marketing  Scheduling patients  Communication with all patients, team labs and suppliers  Take charge of patient flow re documents and payments – this is key.  Active participation in team meetings  Help run the practice smoothly  Person specification  Good listening skills, excellent communication skills  Open to learning “outside the box”, outside the “comfort zone”  Team player  Humble, Punctual, Honest and Sincere  Excellent telephone manner and customer service  Salary: £18,000.00 to £21,000.00 /year  Paid monthly, in arrears, by BACS  Hours:  Will be approx 30 hours per week: to be confirmed  Please send your CV with a covering email letter  Benefits:  Company pension  Schedule:  Monday to Friday  COVID-19 considerations:  COVID-19 considerations: We are fully Covid safe and Covid compliant as well as CQC compliant. We take the safety of our team and our patients extremely seriously.  Application question(s):  Are you willing to be held accountable for the duties and outcomes as described? Do you live within 45 minutes commute of the dental practice? How many years of specifically dental/medical/healthcare reception do you have?  Work Location: In person",
  "Ad_id": "5412004990",
  "search_keywords": {
    "title": "Dental Reception/Administrator",
    "location": "Palmers Green, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Leeds, West Yorkshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038177",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Leeds, West Yorkshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Massage Therapist",
  "location": "Surbiton, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "5 days ago",
  "Salary": "27 per hour per massage. Guaranteed £100 per day",
  "Closes": "18 Jun 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "none": "none",
  "Description": "Massage Harmony are looking for massage therapist with qualifications and experience, required to work in a Thai massage shop in Surbiton. Require staff on various days. The shop opens 10.15am and closes 8.30pm seven days week.  The shop is busy with lovely clients coming in regular. The rooms have heated beds with hot stones & towel warmer inside each of the three rooms. Parking is all free and we have parking at back of the shop too. Surbiton or Tolworth main line are close by, with buses also running regular.  The shop is on a main road situated in lovely Surbiton.We offer £27ph for massage with £100 guaranteed pay. Clean and professional environment. Great tips from customers.Come and join our team.  No accommodation, mainline station to water loo 20 mins walk or by bus. Bus route 281.  Check our reviews on Google and also our website , www.massageharmony.co  Call us on 07702 888890 or whats app",
  "Ad_id": "5411978954",
  "search_keywords": {
    "title": "Massage Therapist",
    "location": "Surbiton, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Southampton, Hampshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038193",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Southampton, Hampshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Domestic couple - Head Gardener & Housekeeper, Devon, 2 bed accomm",
  "location": "Exeter, Devon",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "5 days ago",
  "Salary": "£70k gross pa + 2 bed accommodation",
  "Recruiter": "KATHERINE SHIELDS PRIVATE STAFF LTD",
  "Closes": "18 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "Recommended role for a Head Gardener and Housekeeper couple to look after a beautiful part-time residence in Devon for a London based family. The estate is fully staffed and the Head Gardener will manage the outdoor team including 2 part-time gardeners.  The Head Gardener must have excellent plant and tree knowledge and will take responsibility for the formal garden, herbaceous borders, topiary, rose gardens and fruit and vegetables that are grown in poly tunnels.  The Housekeeper will be hands on and flexible to look after all cleaning and laundry (part time housekeeper employed to assist). Some basic food prep would be appreciated but Chef employed so no real cooking required. The family dogs tend to travel with the family but on occasions may need walking and feeding too. A flexible, \"happy to help\" approach would be ideal for the family who are in residence for only a third of the year.  Two drivers are essential for this role due to the remote location.  The hours are generally 45 per week/5 day week. There is a rota planned 3 months in advance detailing hours and days required.  2 bed self contained accommodation is provided within the grounds of the estate, well behaved pets welcome.  Interviewing now to start when ideal couple found.  Salary negotiable around £70k gross pa",
  "Ad_id": "5411978703",
  "search_keywords": {
    "title": "Domestic couple - Head Gardener & Housekeeper, Devon, 2 bed accomm",
    "location": "Exeter, Devon"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
  "location": "Tyne and Wear",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "20 hours ago",
  "Salary": "£50 - £500 per week",
  "Recruiter": "Avon cosmetics",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay-at-home mums and dads, students, or you in your spare time.  ** IMMEDIATE START **  No experience required  AVON REPRESENTATIVES  work from home sharing your digital link to products to get orders, and earn commission from the sales.  share digital brochure links to find customers online. using facebook and Instagram, whatsapp, etc.  Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you and you earn from those orders.  OR  Share brochures with friends and family to get orders.  Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5412033349",
  "search_keywords": {
    "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
    "location": "Tyne and Wear"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Full time Cleaner Driver",
  "location": "Eccles, Manchester",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "2 days ago",
  "Salary": "£11.40-12.25 PER HOUR + benefits",
  "Recruiter": "Kildare Investment Ltd",
  "Closes": "22 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Direct Employer",
  "Description": "PART TIME CLEANER DRIVER £11.40-12.25 PER HOUR  MON-FRI 9.30AM-2PM  We are looking for a Cleaner/Driver to join our friendly team.  About Kingsmaid; We have the best systems, the best routes, the best uniform, the best support & training and the highest pay in the cleaning industry. Kingsmaid both appreciates and rewards people like you.  If you are the type of person who likes to go the extra mile and enjoys cleaning then you could be just who we are looking for.  Kingsmaid staff enjoy;  · Job security  ·Attractive rate of pay  · Free uniform  · Full training – at a pace to suit you  · Day time hours- Monday to Friday, overtime available if wanted.  · If you enjoy cleaning and have high standards this could be the job for you.  · You do not need any experience - we will train you fully in the Kingsmaid method.  Role Requirements:  a love of cleaning  A full clean driving license and your own car available for work  reliability  You will be required to have a DBS check This is a part time position  we have vacancies for 2-6 days per week Monday to Saturday.  Please specify which days you would like to work on your application.  Kingsmaid provides high quality domestic cleaning services,  using our own brand professional products.  You will be cleaning customers’ homes.  Benefits:  • Bonus scheme  • On-site parking  • Free or subsidised travel",
  "Ad_id": "5412001178",
  "search_keywords": {
    "title": "Full time Cleaner Driver",
    "location": "Eccles, Manchester"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Portsmouth, Hampshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038195",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Portsmouth, Hampshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Chefs Required",
  "location": "Edinburgh",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "5 days ago",
  "Salary": "£12 an hour and upwards depending on experience",
  "Closes": "18 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "No1 High Street Edinburgh are looking for chefs to start immediately. You should have the skills and drive to take our business to the next level. We are part of a larger company and with that you will enjoy all the benefits that include tips, pension and bonus scheme. We always look to promote from within and try and help you achieve your ultimate aim, whether that is becoming a Head Chef or owning your own business, we are here to help.  If you feel that this is the exciting opportunity you were looking for then please send your CV to the General Managers Susan & Anne.",
  "Ad_id": "5411976968",
  "search_keywords": {
    "title": "Chefs Required",
    "location": "Edinburgh"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "SOUTH OF FRANCE - NANNY SOLE CHARGE FROM JUNE 1ST - 30TH SEPTEMER",
  "location": "Welwyn, Hertfordshire",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "1 day ago",
  "Salary": "CIRCA £700.00 PER WEEK NET",
  "Recruiter": "The Graham Agency",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Locum",
  "Description": "SUPERB OPPORTUNITY - SOLE CHARGE NANNY POSITION - 3 YEAR OLD CHILD  ALL NURSERY DUTIES/BABYITTING/FOOD PREPARATION AND COOKING  YOU MUST BE HAPPY TO WORK IN A FULLY STAFFED HOME AND BE PART OF A TEAM.  E.U. PASSPORT  C.V. AND REFERENCES ASAP",
  "Ad_id": "5412028623",
  "search_keywords": {
    "title": "SOUTH OF FRANCE - NANNY SOLE CHARGE FROM JUNE 1ST - 30TH SEPTEMER",
    "location": "Welwyn, Hertfordshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Housekeeper",
  "location": "Crickhowell, Powys",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "6 days ago",
  "Salary": "£25,000 gross pa, plus pension and health",
  "Recruiter": "LJW Recruitment",
  "Closes": "17 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Recruiter",
  "Description": "Private family seeking formally trained and mature Housekeeper for large and well maintained property, to join a domestic team of 4 housekeepers offering high-end cleaning standards.  You will be a team player and self starter, with a trained eye for details, ability to organise, and prioritise day to day workload. Happy to warm up food left by the family Chef, set the table etc. In addition, confident laundry skills and wardrobe management.  Requirements:   Must have 15  years experience in Housekeeping - private or hospitality    Ability to start ASAP    Proven longevity and experience in private service, or hotel background    Energetic, passionate, proactive, flexible, and adaptable    Good communication skills with clear English    Recent and checkable references    Eligibility to work in the UK    DBS clearance (agency can organise)    Must have clean driving licence and car    Hours/Package   Monday – Friday rota with 2 consecutive days off    Occasional evening and weekends when family in residence    45 hours per week    Salary £25,000 gross pa    Health Care    Discretionary bonus    This role would suit a local and experienced Housekeeper, who is available to start asap. Must drive and have own car.",
  "Ad_id": "5411968139",
  "search_keywords": {
    "title": "Housekeeper",
    "location": "Crickhowell, Powys"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live-in Couple",
  "location": "Alness, Highland",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "4 days ago",
  "Salary": "£40,000 - £50,000 joint g.p.a. according to relevant experience",
  "Closes": "20 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "A live-in cook-housekeeper-groundsman-driver couple is required for the private second home of the principals, set on a working highland holiday/sporting estate 30 miles from Inverness.  - Modern accommodation inclusive of Internet and all normal domestic services  - Variable work including involvement in the estate’s business in a support capacity  - Principals are resident approx. 20 weeks per year, spread throughout the year  - Catering normally just for the two principals, with family/friends occasionally staying  - Average 40 hours per 5.5 day week with some flexibility and 28 days holiday p.a.  -Joint salary range £40,000 to £50,000 g.p.a., depending on experience  - No child or pet care involved.  Candidates should be non-smokers with no pets or dependents, and hold clean driving licences.  The role is ideal for those with  - A desire to work in a friendly, cooperative and organised environment  - A passion for creating healthy, interesting, well presented food  - A high standard of all aspects of housekeeping and routine maintenance  - A desire to live in an area of outstanding natural beauty in the Scottish Highlands and take advantage of that environment.  Though the preference is for a couple with relevant experience, an entry level couple with the necessary aptitudes will be considered. Other staff live and work on the estate.  A covering letter addressed for the attention of Mrs Duncan, together with CVs, should be sent to lodgeduo@gmail.com",
  "Ad_id": "5411986289",
  "search_keywords": {
    "title": "Live-in Couple",
    "location": "Alness, Highland"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Experienced MINICAB CONTROLLERS / CO-ORDINATORS Required",
  "location": "West Ealing, London",
  "Hours": "Full Time",
  "Posted": "8 days ago",
  "Salary": "Up to £16 per hour",
  "Recruiter": "Angels Cars",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Come and join our excellent and rapidly growing team. We are a minicab and executive service based in London, which provides a large fleet of vehicles all over London and beyond. We are completing over 5 - 7000 jobs every week.  We are looking for EXPERIENCED, flexible, reliable, punctual, professional & customer-oriented CONTROLLERS / Coordinators & Dispatch.  We are a very well known minicab firm based in London, covering Greater London and the Surrounding Counties.  Controller / Coordinator & Dispatch Main Duties:  Ensuring that journeys are dispatched on time.  Liaising with Head Controller on a daily basis  Monitoring staff and improving call stats and drop call figures.  Dealing with customers & colleagues in a professional and courteous manner.  Requirements:  Over 1 years of experience ESSENTIAL  Be able to use AUTOCAB dispatching system  Speak excellent English & have a good telephone manner  Reliable  Punctual  Team player  Must have great knowledge of London  Best rates of pay in the industry  Our aim is to consistently deliver customer service excellence in the communities we provide services for. As an integral part of the community, we want to serve all with the best possible service. We have ambitious growth plans and require a great team of qualified individuals, who have a passion for excellent customer service.  We are close to overground, underground stations and main bus routes. Parking is available.  Please email us if you are interested in this position. We do not take recruitment phone calls.  Start dates are as soon as possible.",
  "Ad_id": "5411950908",
  "search_keywords": {
    "title": "Experienced MINICAB CONTROLLERS / CO-ORDINATORS Required",
    "location": "West Ealing, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Barber",
  "location": "Orpington, London",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "7 days ago",
  "Salary": "£120+ per day (Dependent of Speed and Quality of Hair Cuts)",
  "Closes": "16 Jun 2023",
  "Course": "No",
  "none": "none",
  "Description": "Experienced Barber Wanted - Must be able to work with all hair types and styles.",
  "Ad_id": "5411964132",
  "search_keywords": {
    "title": "Barber",
    "location": "Orpington, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "SOUTH OF FRANCE - NANNY SOLE CHARGE FROM JUNE 1ST - 30TH SEPTEMER",
  "location": "Welwyn, Hertfordshire",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "1 day ago",
  "Salary": "CIRCA £700.00 PER WEEK NET",
  "Recruiter": "The Graham Agency",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Locum",
  "Description": "SUPERB OPPORTUNITY - SOLE CHARGE NANNY POSITION - 3 YEAR OLD CHILD  ALL NURSERY DUTIES/BABYITTING/FOOD PREPARATION AND COOKING  YOU MUST BE HAPPY TO WORK IN A FULLY STAFFED HOME AND BE PART OF A TEAM.  E.U. PASSPORT  C.V. AND REFERENCES ASAP",
  "Ad_id": "5412028623",
  "search_keywords": {
    "title": "SOUTH OF FRANCE - NANNY SOLE CHARGE FROM JUNE 1ST - 30TH SEPTEMER",
    "location": "Welwyn, Hertfordshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "BRICKLAYERS REQUIRED",
  "location": "Braintree, Essex",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "1 day ago",
  "Salary": "WEEKLY PAID",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "IMMEDIATE START FOR A EXPERIENCED BRICK LAYERS REQUIRED FOR A SITE IN CRESSING - CM77 8JF  MUST HOLD CURRENT CSCS CARD  HAVE OWN TRANSPORT  £230.00 PER DAY  PLEASE CALL BEN ON 07738043737 OR THE OFFICE ON 01621 857182.",
  "Ad_id": "5412025969",
  "search_keywords": {
    "title": "BRICKLAYERS REQUIRED",
    "location": "Braintree, Essex"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Leicester, Leicestershire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038204",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Leicester, Leicestershire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
  "location": "Cardiff",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "20 hours ago",
  "Salary": "£50 - £500 per week",
  "Recruiter": "Avon cosmetics",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay-at-home mums and dads, students, or you in your spare time.  ** IMMEDIATE START **  No experience required  AVON REPRESENTATIVES  work from home sharing your digital link to products to get orders, and earn commission from the sales.  share digital brochure links to find customers online. using facebook and Instagram, whatsapp, etc.  Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you and you earn from those orders.  OR  Share brochures with friends and family to get orders.  Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5412033290",
  "search_keywords": {
    "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
    "location": "Cardiff"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "After school nanny/mother’s help",
  "location": "Camden, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "3 days ago",
  "Salary": "£15 per hour",
  "Closes": "20 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "Central London, W1  We are a family of 4 (B11 and G12) in Central London looking for a fun, confident nanny to look after our 2 children after school, make them a nutritious meal and do some cleaning.  We are looking for a sensible, reliable and dynamic nanny or student to do the following duties:  Monitor the kids after they return from school  Supervise them doing homework and music practice  There will be a requirement to accompany them to an after-school sports club via public transport in the dark winter months once or twice per week.  Cleaning and housework  Cooking a healthy, nutritious meal for the family  Occasionally running errands, food shopping and laundry.  Hours:  Monday, Wednesday & Friday from 4 to 7pm.  We are also happy to offer slightly more or less hours including extra in the holidays and for childminding, if required.  Interviewing now for a start date first week in September. Some sessions in early August to show you the ropes before the school term starts.  Salary: £15 per hour  42 weeks per year.  All applicants must have:  A full enhanced DBS  First aid ability  Contactable references  A UK work permit  Non-smoker  Previous experience preferred but this is not as essential as a kind and common-sense approach.  We are happy if you are not fluent in English but can speak either Spanish or French.  We live 2 minutes from Warren Street Underground Station, with numerous easy public transport connections nearby. There is no need to be a driver.  Our last nanny was with us for 11 years. This is an amazing opportunity for someone who is looking for a long-term position with a very warm, down to earth family.  If interested, please contact Suresh and send a CV to sureshpush12345@gmail.com",
  "Ad_id": "5411987004",
  "search_keywords": {
    "title": "After school nanny/mother’s help",
    "location": "Camden, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live in Gardener for Aberdeenshire (house provided)",
  "location": "Banchory, Aberdeenshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "12 days ago",
  "Salary": "£25k gross pa + house",
  "Recruiter": "KATHERINE SHIELDS PRIVATE STAFF LTD",
  "Closes": "11 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "Experienced Gardener sought for beautiful property for retired employer in rural Aberdeenshire. The garden is approx 2 acres, with a small part of this being formal garden. Additional gardening help provided one day a week also. Would ideally suit a knowledgeable gardener with previous experience working in the Scottish terrain and weather...!  Choice of accommodation can be offered according to requirements from 1 bed flat to 4 bed house! Partner, children and pets welcome.  Salary negotiable according to experience around £25k gross pa.  Interviewing now to start when ideal candidate found.",
  "Ad_id": "5411916698",
  "search_keywords": {
    "title": "Live in Gardener for Aberdeenshire (house provided)",
    "location": "Banchory, Aberdeenshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "After school nanny/mother’s help",
  "location": "Camden, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "3 days ago",
  "Salary": "£15 per hour",
  "Closes": "20 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "Central London, W1  We are a family of 4 (B11 and G12) in Central London looking for a fun, confident nanny to look after our 2 children after school, make them a nutritious meal and do some cleaning.  We are looking for a sensible, reliable and dynamic nanny or student to do the following duties:  Monitor the kids after they return from school  Supervise them doing homework and music practice  There will be a requirement to accompany them to an after-school sports club via public transport in the dark winter months once or twice per week.  Cleaning and housework  Cooking a healthy, nutritious meal for the family  Occasionally running errands, food shopping and laundry.  Hours:  Monday, Wednesday & Friday from 4 to 7pm.  We are also happy to offer slightly more or less hours including extra in the holidays and for childminding, if required.  Interviewing now for a start date first week in September. Some sessions in early August to show you the ropes before the school term starts.  Salary: £15 per hour  42 weeks per year.  All applicants must have:  A full enhanced DBS  First aid ability  Contactable references  A UK work permit  Non-smoker  Previous experience preferred but this is not as essential as a kind and common-sense approach.  We are happy if you are not fluent in English but can speak either Spanish or French.  We live 2 minutes from Warren Street Underground Station, with numerous easy public transport connections nearby. There is no need to be a driver.  Our last nanny was with us for 11 years. This is an amazing opportunity for someone who is looking for a long-term position with a very warm, down to earth family.  If interested, please contact Suresh and send a CV to sureshpush12345@gmail.com",
  "Ad_id": "5411987004",
  "search_keywords": {
    "title": "After school nanny/mother’s help",
    "location": "Camden, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Bournemouth, Dorset",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038186",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Bournemouth, Dorset"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Calling on Mrs Doubtfire! Nanny-housekeeper position in Chelsea from early-mid June",
  "location": "Central London, London",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "11 days ago",
  "Salary": "£50,000+ per annum",
  "Closes": "12 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We are a family with two working parents and two children aged 10 and 8. After years of great nanny support my husband and I are ready for some all-round family and household support and looking for that loving additional member of the family! Ideally you don’t live too far away (we are in Chelsea, off King’s Road), can be with us for 7.30am in the morning to help get the children ready for school and walk them there, then do some housework and cleaning for ~3 hours each day (you need to love cleaning but for the ironing we do have additional help already); we are then pretty flexible for you to have some break-time until the children need to be picked up (around 3.30/4pm) and your day would finish usually at 6.30pm. On some evenings we would need you to have the flexibility to stay a bit longer if we both have an evening engagement. There might also be the odd overnight stay. During half term and holidays we would need you to be with the children full-time but again if they have some days or half-days at a sports camp there will be some down-time. Our children are funny and engaging; on the whole they are self-starters but still need a bit of encouragement and oversight when doing their homework. As they grow to be teenagers we suspect their appetite will increase so if you like cooking that’s a bonus. Maybe you are a mother of slightly older children yourself and would enjoy the challenge? Depending on experience we are happy to pay £50k  gross per year. Please send us your application/ CV and confirm you have relevant references if this position is of interest.",
  "Ad_id": "5411929412",
  "search_keywords": {
    "title": "Calling on Mrs Doubtfire! Nanny-housekeeper position in Chelsea from early-mid June",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Garden maintenance.",
  "location": "Central London, London",
  "Language": "English",
  "Hours": "Full Time",
  "Posted": "12 days ago",
  "Salary": "Depending on experience",
  "Closes": "12 Jun 2023",
  "Course": "No",
  "Contract Type": "Freelance",
  "none": "none",
  "Description": "Garden design and maintenance company looking for a new team member.  Ideally you’ll have either some experience in gardening or a similar practical role or be willing to learn.  More important though is a hardworking, common sense approach and an eye for detail.  We work with a wide variety of clients across London so you will need to be adaptable, polite and speak conversational English. A clean UK driving license is desirable but not essential. And finally, you’ll need to be ok with dogs because we have one on the van most days!.  Please send a CV and an email explaining your current situation and your suitability for the role.  Many thanks,  Billie",
  "Ad_id": "5411929005",
  "search_keywords": {
    "title": "Garden maintenance.",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
  "location": "Belfast City Centre, Belfast",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "20 hours ago",
  "Salary": "£50 - £500 per week",
  "Recruiter": "Avon cosmetics",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay-at-home mums and dads, students, or you in your spare time.  ** IMMEDIATE START **  No experience required  AVON REPRESENTATIVES  work from home sharing your digital link to products to get orders, and earn commission from the sales.  share digital brochure links to find customers online. using facebook and Instagram, whatsapp, etc.  Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you and you earn from those orders.  OR  Share brochures with friends and family to get orders.  Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5412033381",
  "search_keywords": {
    "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
    "location": "Belfast City Centre, Belfast"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Luton, Bedfordshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038187",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Luton, Bedfordshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "VENUE MANAGER",
  "location": "Redbridge, London",
  "Job Level": "Experienced",
  "Hours": "Part Time",
  "Posted": "3 days ago",
  "Salary": "NEGOTIABLE",
  "Closes": "20 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "Venue Manager  We are looking for an organized venue manager to handle the operations, maintenance, and bookings for our venue. In this role, you will be required to create venue pricing packages, secure bookings, liaise with event managers and clients, and coordinate the logistics of events. You will also be required to manage the maintenance of the venue.  To be a successful venue manager, you should demonstrate excellent problem-solving abilities and strong leadership skills. Ultimately, top-notch venue managers are able to anticipate all logistics and requirements for events and show exceptional organizational and interpersonal skills and ensure the venue generates profit for the company.  Responsibilities:  Social media management and updating Developing business plan and new business idea Recruiting and managing temporary /permanent staff Managing all maintenance and repairs of the venue grounds, property, equipment, and facilities. Ensuring that the venue and facilities are clean and organized. Managing all bookings for events and liaising with the clients to determine event requirements. Preparing venue hire packages and pricing options and negotiating with clients. Supervising all staff including groundsmen, event staff, and maintenance personal. Managing of sound equipment, furniture, and other venue equipment. Liaising with catering services and supervising their requirements and logistics. Promoting the location and events through a variety of marketing channels such as social media. Supervising the operations of events and tending to any incidents or queries. Managing all administrative tasks such as insurance, booking schedules, and invoicing. Communicating and enforcing all security regulations and protocols.  Requirements:  Certificate in events management, hospitality, or similar preferred. A minimum of 2 years experience as a venue or event manager preferred. Ability to multitask and remain calm in stressful situations. Excellent promotional ability and knowledge of marketing channels and techniques. Sound knowledge of safety measures and risk management strategies. Great interpersonal and communication abilities. Exceptional organizational and time management skills. Strong negotiation skills and leadership abilities. Willingness to work long hours and on weekends and holidays.",
  "Ad_id": "5411987192",
  "search_keywords": {
    "title": "VENUE MANAGER",
    "location": "Redbridge, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
  "location": "Harrow, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "20 hours ago",
  "Salary": "£50 - £500 per week",
  "Recruiter": "Avon cosmetics",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay-at-home mums and dads, students, or you in your spare time.  ** IMMEDIATE START **  No experience required  AVON REPRESENTATIVES  work from home sharing your digital link to products to get orders, and earn commission from the sales.  share digital brochure links to find customers online. using facebook and Instagram, whatsapp, etc.  Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you and you earn from those orders.  OR  Share brochures with friends and family to get orders.  Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5412033325",
  "search_keywords": {
    "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
    "location": "Harrow, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Courier / Multi-drop Delivery Driver for Amazon West Thurrock",
  "location": "Grays, Essex",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "£870.00-£1,188.00 per week",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "Welcome to Network Global Holdings  We are looking for Multi- Drop Delivery Drivers to join our vibrant team. We currently have several vacancies in multiple locations! Are you looking for a job that offers flexibility, security, and a happy work environment.  EXPERIENCE IS NEEDED  Job Description for Multi-Drop Delivery Driver:  Deliver a number of parcels (all shapes and sizes) to our customers (residential commercial locations) following a sequenced route  What we Require:  Multi-drop experience Full UK Driving Licence held for at least 2 years and with no more than 6 points ID /Passport/RTW/UK Settlement Status (if required) National insurance number Proof of address (within 3 months) UTR (unique tax reference number). We can guide you on how to make an application should you not have one. Criminal background checks performed Able to pass a Drug & Alcohol Test (if required) We also accept owner drivers, but you must be courier insured together with Goods in Transit and Public liability  What we can offer you:  As Multi-Drop Delivery Driver, you can get up to:  - SWB - £145.00 x 6 Days = £870.00   20% VAT = £1044.00*  - LWB - £165.00 x 6 Days = £990.00   20% VAT = £1,188.00*  6 days per week, with working up to 6 days a week, including weekends and bank holidays Daily Bonus during Christmas/busy period Weekly payment Flexible Schedule Self-employed contract 12 days of paid training with reduces routes on 8 of the 12 days Assistance with van rental and no upfront cost to you Fuel Refund per delivery mileage included Phone bill support (£1.80/day) included Routes already in sequence The route will be pre-loaded and ready for you to load and go. Immediate start available Possible extra service payments Weekly bonuses Family & Friend Referral schemes available  To discuss an immediate start for Multi-Drop Delivery Driver, please click below.",
  "Ad_id": "5412019723",
  "search_keywords": {
    "title": "Courier / Multi-drop Delivery Driver for Amazon West Thurrock",
    "location": "Grays, Essex"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "CALL CENTRE STAFF - TELEPHONIST ; CUSTOMER SERVICE OPERATIVES - IMMEDIATE START - WEEKLY PAY",
  "location": "West Ealing, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "7 days ago",
  "Salary": "competitive",
  "Recruiter": "Crawfords of London",
  "Closes": "17 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "Crawford’s are a market leading Private Hire/Courier Company. Due to expansion, we are actively recruiting for an Customer-Service agent to join the busy Day team based in Park Royal W3.  Main responsibilities  · Answering calls from customers and dealing with bookings  · Switchboard duties  · General adhoc admin tasks  What we are looking for:  · Good spoken and written English  · Excellent telephone manner  · Accurate, with strong attention to detail  · Computer literate  · Punctual and reliable  · Prioritisation and organisational skills and ability to work to deadlines in a dynamic environment  · Full training will be given  What we offer:  · Weekly Pay  · Competitive pay  · On-site Parking  · Overtime available  Crawford’s are an equal opportunities employer and welcomes applications from all sections of the community.  If you would like to join the team, please get in touch…  Crawford’s are a market leading Private Hire/Courier Company. Due to expansion, we are actively recruiting for an Customer-Service agent to join the busy Day team based in Park Royal W3.  Main responsibilities  · Answering calls from customers and dealing with bookings  · Switchboard duties  · General adhoc admin tasks  What we are looking for:  · Good spoken and written English  · Excellent telephone manner  · Accurate, with strong attention to detail  · Computer literate  · Punctual and reliable  · Prioritisation and organisational skills and ability to work to deadlines in a dynamic environment  · Full training will be given  What we offer:  · Weekly Pay  · Competitive pay  · On-site Parking  · Overtime available  Crawford’s are an equal opportunities employer and welcomes applications from all sections of the community.  If you would like to join the team, please get in touch…",
  "Ad_id": "5411967066",
  "search_keywords": {
    "title": "CALL CENTRE STAFF - TELEPHONIST ; CUSTOMER SERVICE OPERATIVES - IMMEDIATE START - WEEKLY PAY",
    "location": "West Ealing, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Part time cleaners required immediate start in Evesham,Pershore,Droitwich,and Worcester .£12 an hour",
  "location": "Tewkesbury, Gloucestershire",
  "Hours": "Part Time",
  "Posted": "6 days ago",
  "Salary": "12 an hour",
  "Recruiter": "NATIONWIDE CLEANERS GLOS WARWICK WORCESTERSHIRE LTD",
  "Closes": "18 Jul 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "Recruiter Type": "Recruiter",
  "none": "none",
  "Description": "Cleaners are required for domestic cleaning work in Evesham, Pershore, Droitwich, Worcester,Bidford on Avon, Stratford upon Avon and surrounding areas  Reliable, punctual, and conscientious.  Drivers with the use of cars are ideal .You must have a car unless you live locally.  Part-time, Daytime-Weekdays  dusting and polishing furniture.  vacuuming/cleaning carpets.  mopping floor tiles.  Good interpersonal and communication skills",
  "Ad_id": "5411976388",
  "search_keywords": {
    "title": "Part time cleaners required immediate start in Evesham,Pershore,Droitwich,and Worcester .£12 an hour",
    "location": "Tewkesbury, Gloucestershire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Plasterer",
  "location": "Radstock, Somerset",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "7 days ago",
  "Salary": "£25-35K Depending on Experience",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Foundations Up Construction Ltd need a Plasterer to work on extensions, alterations, refurbishment and new-build. Salaried position with van. We are looking for reliable and motivated tradespeople to join our fun, high achieving team!  Role: We are looking for a Plasterer with at least 2 years experience, who is must be willing to work on a wide range of other tasks as part of our close and skilled team.  Location: Bath, South and East Bristol, North Somerset, West Wiltshire and North Dorset. We’re based between Frome and Radstock.  You will need to be friendly, articulate, with excellent communications skills to deal with both customers and with colleagues on site when you are leading small teams. A sound understanding in all aspects of domestic construction would be an advantage. We would expect the successful applicant to have a minimum of 2 years’ experience.  You will be required to work on larger domestic construction projects with other trades from the company and sometimes subcontractors. You will also be required to work independently on smaller projects, taking responsibility for the whole job and any staff supporting you.  The types of work that you will be required to perform include renovations, new builds, plastering and patio work and assisting on extensions. On occasion you might be required to assist with various repair and maintenance tasks. Supervision and training will be provided until you are confident about the high standards we strive to maintain.  This is a hugely exciting opportunity for an ambitious and driven candidate with a passion for construction.  Key Responsibilities:  Initially:  Assist on large domestic and commercial construction projects, working as part of a team to deliver the overall project on time and on budget.  Discuss and inform customers about progress so that they understand the work you are completing and so they are receiving the levels of service our customer expect.  Manage and maintain the tools and vehicle provided to you so that you have the right and serviceable equipment for the jobs that you are asked to perform.  Lead a small team operating independently completing small projects,  Assisting on other projects, such as laying patios and filling chases and any other small projects required. The size and complexity will depend on ability and experience.  As progression:  Manage and account for materials and consumables that will be required on jobs, including ordering, collecting and checking required stock before arriving on a job. You will also be required to manage and arrange returns of excess, unused stock and materials.  Manage your own timesheet and take responsibility for the timesheets of any staff working with you on any job where you are leading the team.  Complete any job related ‘paperwork’ such as job sheets as required so that all details of the work has been recorded accurately.  Essential Skills & Experience:  Keen interest in construction  Fluent and excellent communicator  Drive and determination, keen to learn and ability to work in a dynamic and exciting business  3 years construction experience, particularly plastering  Full drivers licence  Benefits:  Competitive Salary - based on skills and experience  Profit share bonus scheme  Company Van  Holiday entitlement 20 days plus Public and Bank Holidays  Working as part of a multi skilled team and learning new skills.  Eligibility to join a company pension scheme  Usual hours worked Monday to Friday (weekend work available on request)  Job Type: Full-time  Salary:  £25,000.00-£35,000.00 per year depending on experience  Schedule:  Monday to Friday  Supplemental pay types:  Bonus scheme  Tips  Yearly bonus  Essential:  Ability to commute/relocate to Radstock BA3 5RX  Driving Licence",
  "Ad_id": "5411968109",
  "search_keywords": {
    "title": "Plasterer",
    "location": "Radstock, Somerset"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Temporary summer worker",
  "location": "Aberdeen",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "4 days ago",
  "Salary": "£10.42 per hour",
  "Closes": "20 Jun 2023",
  "Course": "No",
  "Contract Type": "Locum",
  "none": "none",
  "Description": "We are looking for a part time worker with additional hours as needed.  The job is to assist with the extra work for our pest control business. This will be mainly dealing with wasp nest eradication.  The following is essential:  A CLEAN CURRENT driving licence  Ability to learn quickly, training will be given to a satisfactory standard.  Able to use modern technology  Be of smart appearance, uniform will be supplied.  People who are early retired or a student usually suit this vacancy.",
  "Ad_id": "5411986606",
  "search_keywords": {
    "title": "Temporary summer worker",
    "location": "Aberdeen"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Multi Tradesperson - Work for a reliable & forward thinking Property Developer!",
  "location": "Central London, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "6 days ago",
  "Salary": "Up to £190 p.d. plus company vehicle & travel expenses",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "none": "none",
  "Description": "Gaughan Group provide a full and comprehensive range of property facilities management, building services, construction, and maintenance solutions to high end commercial clients across London and Wiltshire.  Gaughan Group cover all residential maintenance, disabled adaptations and can undertake any type of refurbishment project within most types of contractual framework.  Celebrating 11 years in Business. Experts trained and certified in all our trades. Trusted by Property Managers and Landlords.  We are looking for new multi trades person to join our growing business. We have several sites in Wiltshire which will follow continuously one after the other, so we require reliable and multi skilled workers to join our ever growing team. The works will be a mixture of maintenance, refurbs and larger projects, so varied experience and being able to be flexible is key!  You will require generic experience across the board of the following:  Bathroom and kitchen refurbishments General carpentry Foundations/groundwork/Roofing Strong knowledge of plumbing and electrical Extensions Tiling Internal renovations Brick work/blockwork All other aspects of the building trades  Your duties will include -  Meeting with potential customers, discussing the works they require, taking measurements etc and relaying the information back to the project managers Keeping working areas clean and tidy Working to a schedule of works and timeframes Ensuring health and safety procedures and safe working practices are adhered to. To carry out all works to the highest standard  Candidates must have their own tools and be fluent in English.  This is a fantastic opportunity to become a part of a busy, progressive company who can offer a rewarding working environment and scope for future growth and progression.  This role is working on a self employed basis.",
  "Ad_id": "5411968145",
  "search_keywords": {
    "title": "Multi Tradesperson - Work for a reliable & forward thinking Property Developer!",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "2 x Part Time Support Workers Required, 15 hours per week, £12.50 per hour, Islington N5",
  "location": "Islington, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "9 days ago",
  "Salary": "£12.50 Per hour 5.6 weeks paid holiday pro rata",
  "Recruiter": "Islington Direct Payments Team",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Recruiter",
  "Description": "2 x Part Time Support Workers Required, 15 hours per week, £12.50 per hour, Islington N5 (Ref: AH.AK.01)  Two Support Workers are required to assist a 30-year-old man who is a wheelchair user dependant on help for ALL aspects of personal care, accessing the community, attending appts, etc.  My mother is available most of the time for help and advice.  Training for lifting & handling and epilepsy awareness can be arranged if needed.  You will work 3 x 5-hour sessions between Monday to Friday for two weeks and then one weekend (Saturday am and Sunday pm) which includes going swimming, with one midweek session.  Please note there is smoking within the domestic environment and a dog.  Duties will include supporting with personal care, support to attend appointments and assistance with accessing social activities  Reliability is essential.  Actual days and times are negotiable and can be discussed further at interview.  Pay: £12.50 per hour, paid monthly.  Prior experience in care work is not necessary though may be helpful. This job is subject to DBS disclosure. NOT Cash in Hand.  If you are interested in applying for this post, please reply with your CV quoting the reference AH.AK.01 and a covering message telling me a little about yourself.  Please note: the successful applicant will be employed directly by the client and not by Islington council and there will be a 12 week probation period.",
  "Ad_id": "5411945314",
  "search_keywords": {
    "title": "2 x Part Time Support Workers Required, 15 hours per week, £12.50 per hour, Islington N5",
    "location": "Islington, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "CAR VALETING PERSONX1 RECOVERY TRUCK DRIVERX1",
  "location": "Watford, Hertfordshire",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "7 days ago",
  "Salary": "45 HOURS PER WEEK PLUS OVER TIME",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "VALETING:  The Car Valet is responsible for cleaning and maintaining the inside and outside of cars. This includes washing, waxing, polishing, vacuuming, and shampooing. The Car Valet must be able to work independently and as part of a team. They must also be able to follow instructions and meet deadlines.  Essential Duties and Responsibilities:  Clean and maintain the inside and outside of cars, including washing, waxing, polishing, vacuuming, and shampooing. Use a variety of cleaning products and equipment safely and effectively. Follow customer instructions and meet deadlines. Work independently and as part of a team. Maintain a clean and organized work area. Report any damage to cars to the Auto Detailing Manager.  Physical Demands:  The Car Valet must be able to stand, walk, and reach for extended periods of time. They must also be able to lift and carry up to 50 pounds.  Work Environment:  The Car Valet will work in a variety of environments, including inside and outside of cars. They may be exposed to noise, dust, and fumes.  Benefits:  Competitive salary and benefits package. Opportunity to work for a growing company. Chance to learn new skills and advance your career.  DRIVER:  Driver Wanted  We are looking for a safe and experienced driver to join our team. The ideal candidate will be at least 25 years old with a clean driving record. You will be responsible for transporting goods and materials between our various locations. This is a full-time position with competitive pay and benefits.  Responsibilities  Transport goods and materials between our various locations Maintain a clean driving record Follow all safety procedures Be punctual and reliable Communicate effectively with other drivers and staff  Qualifications  Must be at least 25 years old Must have a valid driver's license  If you are interested in this position, please send your resume and cover letter to [email protected]  We look forward to hearing from you!  call us on 0 7 5 4 8 2 4 7 3 2 7",
  "Ad_id": "5411968118",
  "search_keywords": {
    "title": "CAR VALETING PERSONX1 RECOVERY TRUCK DRIVERX1",
    "location": "Watford, Hertfordshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "EXPERIENCED MINICAB CONTROLLERS, DISPATCHERS, CO-ORDINATORS WANTED!",
  "location": "West Ealing, London",
  "Hours": "Full Time",
  "Posted": "7 days ago",
  "Salary": "£13 - £16 PER HOUR",
  "Recruiter": "COMPANY NAME DISCLOSED ONCE YOU HAVE APPLIED, FOR CONFIDENTIALITY REASONS",
  "Closes": "16 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Experienced Minicab Controllers, Dispatchers, Co-ordinators WANTED  Come and join our excellent and rapidly growing team. We are one of the largest minicab and executive service based in London, which provides a large fleet of vehicles all over London and beyond.  Our aim is to consistently deliver customer service excellence in the communities we provide services for. As an integral part of the community we want to serve all with the best possible service. We have ambitious growth plans and require a great team of quality individuals, who have a passion for excellent customer service.  Experienced Minicab Controllers, Dispatchers, Co-ordinators WANTED  Benefits include:  - Pay to suit the best  - Flexible working hours to suit your needs  What we are looking for:  - People with great customer service  - A positive attitude and good time keeping  Minimum 1 Years Experience In This Field Is Required For Controllers and Dispatchers or CO-ORDINATOR  Experience of working with a minimum of 25 cars plus per shift  We are a 24 hour, 7 day a week operation offering part time and full time positions with flexible hours.  (If you fit the above criteria please call 02033881295)",
  "Ad_id": "5411958398",
  "search_keywords": {
    "title": "EXPERIENCED MINICAB CONTROLLERS, DISPATCHERS, CO-ORDINATORS WANTED!",
    "location": "West Ealing, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "BRICKLAYERS REQUIRED",
  "location": "Chelmsford, Essex",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "21 hours ago",
  "Salary": "WEEKLY PAID",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "IMMEDIATE START FOR EXPERIENCED BRICKLAYERS FOR A SITE IN LATCHINGDON = CM3 6LJ  MUST HOLD A CURRENT CSCS CARD  OWN TRANSPORT REQUIRED  CURRENT RATE OF £230.00 PER DAY  PLEASE CONTACT BEN ON 07738043737 OR THE OFFICE ON 01621857182",
  "Ad_id": "5412031427",
  "search_keywords": {
    "title": "BRICKLAYERS REQUIRED",
    "location": "Chelmsford, Essex"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Sandwich Slinger! (Mornings only)",
  "location": "Finsbury Park, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Morning",
  "Posted": "2 days ago",
  "Salary": "£12",
  "Recruiter": "Fink’s Chats",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "Come join our team! Sandwich prep cook wanted - making fantastic sandwiches with great produce in a small friendly kitchen. Great hours would suit a parent or student.  Job description  - Help with the day to day production of sandwiches and some additional food prep.  - The job also involves kitchen maintenance, eg doing dishes, packing and unpacking deliveries.  - Plenty of room to grow (if you want)!  - Fridays and one weekend day essential, but daytime hours only. Paid overtime (optional). No live orders - prep only!  - Short working days. Opportunity for more work if you’d like it.  Job requirements  - Some kitchen experience is essential, but enthusiasm, energy, adaptability and a great attitude is more important.  - Opportunity for growth.  - Must have a quick hand and an eye for detail.  Meals on shift  Cycle to Work Scheme  London Living Wage Employer  Paid overtime (optional)  Daytime only",
  "Ad_id": "5411993795",
  "search_keywords": {
    "title": "Sandwich Slinger! (Mornings only)",
    "location": "Finsbury Park, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "E-Commerce Customer Service Manager",
  "location": "North Berwick, East Lothian",
  "Language": "English",
  "Job Level": "Management",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Up to £30,000 per annum + Benefits",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Customer Service Manager wanted for an online retailer of specialist outdoor clothing & equipment.  A fantastic opportunity has arisen for a Customer Service Manager to combine their enthusiasm for the great outdoors with their flair for customer service and great administration.  Established in 2010 by people who were born and raised in the country, ArdMoor.co.uk has gone from strength to strength. Focusing on all things outdoor, from country clothing and footwear to shooting, stalking, sailing, outdoor and work clothing & equipment. ArdMoor has quickly become one of the leading companies in its marketplace. Now we need your help to take us to the next stage in our development.  THE ROLE:  We are looking for a person to join our ambitious team, where you’ll be responsible for giving our customers a world class experience of shopping online at ArdMoor ensuring they return to shop with us again.  Alongside others in the team, you will be deal with our customer’s enquiries, telephone orders and any issues arising with their orders once placed to include managing parts of our back-office stock management system and inputting into the content that is shown on our web site.  This is an exciting opportunity for an enthusiastic team player looking to make their mark in a close-knit team doing a job that is key to the development of our business.  You’ll have a proven track record of excellent communication skills, fantastic telephone manner, dealing with members of the public, giving clear and concise guidance and advice as required and of problem solving. Communication and lateral thinking are two of your key strengths and you’ll be able to bring a cheerful, respectful approach to dealing with our customers as a result.  Reliability in completing work to agreed standards and in a timely fashion and being process driven are essential skills. Your outstanding communication skills will ensure you’re able to keep other team members informed of progress and any issues.  You’ll report to the Web Trading Manager and will have an enthusiastic, self-motivated approach to work that will enable you to work both independently and as an influential team member from day one.  Key Responsibilities  Deliver customer satisfaction and retention through ensuring teams timely response to orders, product delivery, issues, faulty items, and complaints. Develop plans and targets and report on metrics to improve customer satisfaction. Develop customer service policies, procedures, and standards and ongoing training of these procedures. Be committed to meeting KPIs, including quality and productivity targets; playing a pivotal role in helping the department to achieve its overall goals. Be the ‘go to’ for any customer service team queries. Overall responsibility of the training and development of your team. Communicate relevant messages to your team about merchandising and upsell of items held in the warehouse. Be the 'voice' of the customer within ArdMoor and provide feedback to all other teams to drive continuous product improvement and customer success. Develop an in-depth understanding of our products and run regular training sessions alongside Ops Manager on new products added to the website, with a focus on forward order items which will be held in the warehouse. Liaise with external suppliers to ensure prompt delivery of items. Place and oversee Purchase Orders daily, and daily checking by yourself or team members so that these items arrive in a timely fashion to avoid orders being cancelled. Encourage the team to make phone calls rather than emails to suppliers to get faster responses. Processing of faulty claims with suppliers and timely communication with customers about a resolution. Encourage the team to offer an alternative item held in the warehouse before customer cancelling order. Ensuring swift handling of leads to relevant sales teams, and encourage your team to be aware of the customer they are speaking to - ie VIP Manage the day-to-day customer service team (including home workers) to ensure that the telephones are covered and that lunch breaks do not clash where possible. Overall responsibility to lead, inspire, develop, and motivate customer service team to deliver a best-in-class customer experience. Support colleagues with the use of in-house tools, by providing necessary training and advice. Carry out all tasks in an efficient professional and courteous manner, leading by example to the Customer Service Department. Liaise with the Financial Controller about invoices and credits. Continue to learn.  Requirements  Great communication skills Excellent telephone manner Problem Solving can-do attitude. Experience working in the retail sector advantageous. Proven track record in sales experience IT literacy – in particular MS Office High attention to detail Proactive team player, with excellent communication skills Self-motivated and enthusiastic approach Experience of, or interest in, at least one of the key areas of our key marketplaces ie shooting, outdoors, workwear, sailing, country etc advantageous  WHAT YOU CAN EXPECT FROM THE ROLE  You will be part of one of the UK’s premium outdoor e-tailers. You will be based in our office at Kingston, North Berwick, East Lothian EH39 5LT. You will have access to support and training where you will get as much assistance as you require. You will have a generous staff discount on all products on the ArdMoor site. How To Apply: Please email your CV and a covering letter to Caroline Campbell on cc@ardmoor.co.uk",
  "Ad_id": "5412029400",
  "search_keywords": {
    "title": "E-Commerce Customer Service Manager",
    "location": "North Berwick, East Lothian"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
  "location": "Belfast",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "8 days ago",
  "Salary": "COMMISSION ONLY JOB",
  "Recruiter": "Avon - Julie Pearce",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay at home mums and dads, students or you in your spare time.  ** IMMEDIATE START **  Part time or Full time  No experience required  Very flexible, work around your family, studies, job etc when you want.  AVON REPRESENTATIVES  Share brochures with friends and family to get orders.  Use the digital brochure links to find customers online. Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you.  OR Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5411946352",
  "search_keywords": {
    "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
    "location": "Belfast"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live in couple - Cook/Chef and Kitchen hand - 5 week Summer Job",
  "location": "Frinton-on-Sea, Essex",
  "Language": "English",
  "Hours": "Full Time",
  "Posted": "7 days ago",
  "Salary": "£1000 per week plus food and accomodation",
  "Closes": "17 Jun 2023",
  "Course": "No",
  "none": "none",
  "Description": "We are seeking a couple, or two friends, to work as cooks for a large family in their home in Frinton-on-Sea during the summer. The position is from 5th July until 9th August and is live-in with separate accommodation and food provided.  You would be required to prepare and serve a buffet Lunch and supper for approximately 20 people each day. You must be confident and capable cooks with the ability to prepare meals to suit a range of people including vegetarians/vegans. You will also need to prepare desserts to accompany each meal. Whilst most meals are casual buffet style, they also like to have a couple of formal dinners during their time in Frinton, especially utilising the fresh seafood on offer.  This position is 5 days per week with 2 days off to suit the family. You must be flexible to suit the needs of the family and a split shifts will be required.  Accommodation and all meals are provided, and you can be provided with use of a car with fuel for your day off. Salary is £500 per week per person negotiable.  This position would ideally suit a couple who have previous experience working in a ski chalet or similar. It is essential that at least one of you has a valid driver’s licence.  Please include CVs with checkable references.",
  "Ad_id": "5411967333",
  "search_keywords": {
    "title": "Live in couple - Cook/Chef and Kitchen hand - 5 week Summer Job",
    "location": "Frinton-on-Sea, Essex"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Mobile Phone and Computer Repair Technician - Full time / Part Time",
  "location": "Edinburgh",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "7 days ago",
  "Salary": "24.5K-27K + bonuses - FULL TIME",
  "Closes": "16 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Mobile phone repair technician  Hex is currently looking for Full-time / Part-time technicians to join our busy team at our Tollcross Repair Centre.  Hex is the Edinburgh leading smartphone, tablet and computer repair centre running under the same management since established in 2008. We specialise in repairs of all major brands of devices including Apple, Samsung, Huawei and others.  Responsibilities include:  Diagnostic and repairs ( hardware and software ) High standard of customer service ( phone and face to face ) Follow directions from senior technician Follow Health and Safety procedures Promote the brand  Experience required:  Previous experience in repair and diagnostics of Smartphones and Tablets – ( Apple and Android ) Previous experience in repair and diagnostics of Computers ( Mac and PC – laptops and desktops ) Ability to repair most common issues such as screen replacement, battery replacement, charging port repair. Proficiency in soldering and component level repairs – preferred but not essential Attention to detail and high standard of repairs Can do attitude, good teamwork and problem solving abilities. Ability to manage own workload  Hex offers permanent full-time ( 5 days per week ) or part-time positions working between Monday-Sunday.  28 days paid holiday  £24.5-£27K annual salary   bonuses  Please contact Manager by sending your CV at dariusz@hexcs.com.",
  "Ad_id": "5411959220",
  "search_keywords": {
    "title": "Mobile Phone and Computer Repair Technician - Full time / Part Time",
    "location": "Edinburgh"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Labourer Required for Residential New Build in SW19",
  "location": "Wimbledon, London",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "5 days ago",
  "Salary": "£120/day (£15/h)",
  "Closes": "18 Jun 2023",
  "Course": "No",
  "Contract Type": "Sub Contractor",
  "none": "none",
  "Description": "Experienced and hardworking labourer required to join our team on a residential projects in Wimbledon & Southfields. You will be generally site labouring, assisting trades with material deliveries & tidying. Approx 6 months minimum.  £120/day 8h/day. (£15/h). (Must be CIS registered).  We are a predominantly residential developer and contractor based in SW London and established in 1985.  Please respond with a short description of your previous projects.  Thank you",
  "Ad_id": "5411977723",
  "search_keywords": {
    "title": "Labourer Required for Residential New Build in SW19",
    "location": "Wimbledon, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Mobile Phone and Computer Repair Technician - Full time / Part Time",
  "location": "Edinburgh",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "7 days ago",
  "Salary": "24.5K-27K + bonuses - FULL TIME",
  "Closes": "16 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Mobile phone repair technician  Hex is currently looking for Full-time / Part-time technicians to join our busy team at our Tollcross Repair Centre.  Hex is the Edinburgh leading smartphone, tablet and computer repair centre running under the same management since established in 2008. We specialise in repairs of all major brands of devices including Apple, Samsung, Huawei and others.  Responsibilities include:  Diagnostic and repairs ( hardware and software ) High standard of customer service ( phone and face to face ) Follow directions from senior technician Follow Health and Safety procedures Promote the brand  Experience required:  Previous experience in repair and diagnostics of Smartphones and Tablets – ( Apple and Android ) Previous experience in repair and diagnostics of Computers ( Mac and PC – laptops and desktops ) Ability to repair most common issues such as screen replacement, battery replacement, charging port repair. Proficiency in soldering and component level repairs – preferred but not essential Attention to detail and high standard of repairs Can do attitude, good teamwork and problem solving abilities. Ability to manage own workload  Hex offers permanent full-time ( 5 days per week ) or part-time positions working between Monday-Sunday.  28 days paid holiday  £24.5-£27K annual salary   bonuses  Please contact Manager by sending your CV at dariusz@hexcs.com.",
  "Ad_id": "5411959220",
  "search_keywords": {
    "title": "Mobile Phone and Computer Repair Technician - Full time / Part Time",
    "location": "Edinburgh"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Facilities / office manager / administrator",
  "location": "Camden, London",
  "Language": "English",
  "Job Level": "Management",
  "Hours": "Full Time",
  "Posted": "3 days ago",
  "Salary": "£21,000 - £25,000",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We are seeking a facilities manager / administrator.  We are a relaxed, family-owned serviced office centre based in the heart of Primrose Hill, from which about 30 business choose to be located.  As one of two managers, you will be required first and foremost to be a friendly, and welcoming person representing the business to existing and prospective tenants, visitors and contractors.  The role has both administrative (invoicing, accounts, securing new tenants, document management etc) and maintenance (eg basic plumbing, electrical and decorating) facets, with an overarching requirement to be proactive in dealing with matters as they arise.  Some out of hours working may be required  Please send a CV, scan of passport and covering email in the first instance to info@phbcoffices.co.uk",
  "Ad_id": "5411991532",
  "search_keywords": {
    "title": "Facilities / office manager / administrator",
    "location": "Camden, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Window fitters",
  "location": "Bromley, London",
  "Language": "English",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "2 days ago",
  "Salary": "dependant on experience",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Family-run glazing business based in Westerham requires a reliable, experienced window fitter (or team)for immediate start.  Must be professional, able to measure and fit UPVC windows and doors to a high standard, and undertake repairs where required.  Essential requirements: full clean driving licence valid in UK, ability to work on own initiative, attention to detail.  Monday to Friday 08:00-17:00, Excellent rates for the right person/team and overtime available if wanted.  Just taken on a 5 year contract in Guildford area.  Please call our office 01959 571200 and ask to speak to Bob or email rstglassandglazing@live.co.uk  Job Type: Full-time",
  "Ad_id": "5412000298",
  "search_keywords": {
    "title": "Window fitters",
    "location": "Bromley, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "COUPLE TO LIVE IN REGENTS PARK -EXPERIENCED/PRO ACTIVE -HK AND CHAUFFEUR /SECURITY",
  "location": "Camden, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "12 days ago",
  "Salary": "CIRCA £75,000.00 P.A. (NEGOTIABLE)",
  "Recruiter": "The Graham Agency",
  "Closes": "11 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "BUSY PROFESSIONAL FAMILY ( 3 CHILDREN-THERE IS A NANNY) ARE LOOKING FOR AN EXPERIENCED COUPLE/MUST BE PRO ACTIVE/FLEXIBLE, TO WORK AS A TEAM IN RUNNING THEIR HOME -  HOUSEKEEPING DUTIES WITH ANOTHER LIVE OUT HOUSEKEEPER/ DAY TO DAY HOUSEKEEPING, FULL WARDROBE MANAGEMENT, FINE FABRICS, ORGANISING, PACKING AND UNPACKING, TO PREPARE AND COOK FAMILY MEALS WHEN THE CHEF IS AWAY, ENSURE THE HOME IS ALWAYS STOCKED WITH ESSENTIALS.  FULL DRIVING DUTIES, SECURITY (MILITARY BACKGROUND AN ADVANTAGE) MAINTAINING THE OUTSIDE OF THE HOME, TERRACES ETC., LIAISE WITH GARDENERS, CONTRACTORS, TRADES PERSONS, RUN ERRANDS.  FULLY SELF CONTAINED ACCOMMODATION WITH OWN ENTRANCE  5 DAY WEEK - DAYS OFF SUNDAY AND MONDAY  TRAVE; WITH THE FAMILY.  EXPERIENCE AND FULL FLEXIBILITY ESSENTIAL",
  "Ad_id": "5411919982",
  "search_keywords": {
    "title": "COUPLE TO LIVE IN REGENTS PARK -EXPERIENCED/PRO ACTIVE -HK AND CHAUFFEUR /SECURITY",
    "location": "Camden, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "ASSISTANT BAKER FOR ARTISAN BAKERY FOR WANDSWORTH BAKERY",
  "location": "Wandsworth, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 days ago",
  "Salary": "Up to £32,000 plus tips",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We run an amazing sourdough bakery, deli and restaurant in Wandsworth called The Toast Rack Bake House.  He have an amazing head baker with loads of experience and producing amazing sourdoughs.  We are looking for an assistant baker to increase production, develop the product range and share the load.  Experience in baking at an artisan sourdough bakery is a MUST but mostly reliability and a passion for bread is key.  The bakery is fully fitted with mixers, proofer, 3 deck oven plus all other necessary equipment. All equipment is in excellent condition. We use Marriages Organic for 95% of our bread.  You will be joining more than a bakery and will plenty of facetime with the young lively restaurant team and kitchen.  The breads we produce are inspired by the world famous Tartine Bakery. We use the breads in the kitchens on site, delivered to our sister restaurants and in the future for wholesale into other units.  The bakery range includes:  Classic Sourdough Light Rye Seven Seed Dark Rye Baguettes Pizza dough  We are an experienced team but need the right candidate to really realise our dream for the bakery.  Free parking on site if you drive.  Please get in touch.",
  "Ad_id": "5411996408",
  "search_keywords": {
    "title": "ASSISTANT BAKER FOR ARTISAN BAKERY FOR WANDSWORTH BAKERY",
    "location": "Wandsworth, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
  "location": "Bolton, Manchester",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "8 days ago",
  "Salary": "COMMISSION ONLY JOB",
  "Recruiter": "Avon - Julie Pearce",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay at home mums and dads, students or you in your spare time.  ** IMMEDIATE START **  Part time or Full time  No experience required  Very flexible, work around your family, studies, job etc when you want.  AVON REPRESENTATIVES  Share brochures with friends and family to get orders.  Use the digital brochure links to find customers online. Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you.  OR Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5411946121",
  "search_keywords": {
    "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
    "location": "Bolton, Manchester"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Multi Drop Driver",
  "location": "Wallasey, Merseyside",
  "Hours": "Part Time",
  "Posted": "1 day ago",
  "Salary": "£20-£40 Per Hour",
  "Recruiter": "Advio",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Sub Contractor",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Job Title: Parcel Delivery Driver  Location: WALLASEY  Job Type: Flexible, Part-time/Full-time  Salary: £20-£40 per hour (average pay)  We are currently seeking reliable and motivated individuals to join our team as Parcel Delivery Drivers. As a delivery driver, you will be responsible for delivering parcels to customers in your local area using your own car or van.  Key Responsibilities:  Collecting parcels from the depot and delivering them to customers' addresses Ensuring parcels are delivered on time and in good condition Providing excellent customer service Maintaining accurate records of deliveries made Ensuring that all parcels are delivered safely and securely  Requirements:  A full UK driving license and access to your own car/van Valid Insurance,MOT & Tax A smartphone with GPS capabilities Good communication skills and the ability to provide excellent customer service Flexibility to work on a part-time basis, with the ability to choose your own hours No previous experience required, training will be provided  Benefits:  Bi-weekly pay Pay for each item you deliver Competitive hourly rate, with highly achievable pay rates of £20-£40 per hour Flexible working hours, allowing you to choose when you want to work The ability to go straight home after completing your deliveries, with no need to return to the depot Excellent Work-Life balance  We Have work 7 days a week it's up to you to when you want to work, no commitments!  If you are interested in this exciting opportunity, please apply now via WhatsApp 07497 608 909 stating your full name,email address and area you wish to work.",
  "Ad_id": "5412026728",
  "search_keywords": {
    "title": "Multi Drop Driver",
    "location": "Wallasey, Merseyside"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
  "location": "Cardiff",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "20 hours ago",
  "Salary": "£50 - £500 per week",
  "Recruiter": "Avon cosmetics",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay-at-home mums and dads, students, or you in your spare time.  ** IMMEDIATE START **  No experience required  AVON REPRESENTATIVES  work from home sharing your digital link to products to get orders, and earn commission from the sales.  share digital brochure links to find customers online. using facebook and Instagram, whatsapp, etc.  Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you and you earn from those orders.  OR  Share brochures with friends and family to get orders.  Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5412033290",
  "search_keywords": {
    "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
    "location": "Cardiff"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "BRICKLAYERS REQUIRED",
  "location": "Braintree, Essex",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "1 day ago",
  "Salary": "WEEKLY PAID",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "IMMEDIATE START FOR A EXPERIENCED BRICK LAYERS REQUIRED FOR A SITE IN CRESSING - CM77 8JF  MUST HOLD CURRENT CSCS CARD  HAVE OWN TRANSPORT  £230.00 PER DAY  PLEASE CALL BEN ON 07738043737 OR THE OFFICE ON 01621 857182.",
  "Ad_id": "5412025969",
  "search_keywords": {
    "title": "BRICKLAYERS REQUIRED",
    "location": "Braintree, Essex"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
  "location": "Cardiff",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "20 hours ago",
  "Salary": "£50 - £500 per week",
  "Recruiter": "Avon cosmetics",
  "Closes": "23 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay-at-home mums and dads, students, or you in your spare time.  ** IMMEDIATE START **  No experience required  AVON REPRESENTATIVES  work from home sharing your digital link to products to get orders, and earn commission from the sales.  share digital brochure links to find customers online. using facebook and Instagram, whatsapp, etc.  Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you and you earn from those orders.  OR  Share brochures with friends and family to get orders.  Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5412033290",
  "search_keywords": {
    "title": "AVON REPS-FULL OR PART TIME -IMMEDIATE START -ALL AREAS OF UK - WORK FROM HOME",
    "location": "Cardiff"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Barber",
  "location": "Orpington, London",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "7 days ago",
  "Salary": "£120+ per day (Dependent of Speed and Quality of Hair Cuts)",
  "Closes": "16 Jun 2023",
  "Course": "No",
  "none": "none",
  "Description": "Experienced Barber Wanted - Must be able to work with all hair types and styles.",
  "Ad_id": "5411964132",
  "search_keywords": {
    "title": "Barber",
    "location": "Orpington, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Male Carer/Driver",
  "location": "Reading, Berkshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Part Time",
  "Posted": "1 day ago",
  "Salary": "20 per hour",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "none": "none",
  "Description": "WE ARE LOOKING FOR A CARER/DRIVER 20 PER HOUR RISING IN THE NEXT FEW MONTHS  VALID DRIVING LISCENCE  FAMILIAR AND COMFORTABLE WITH CARIBBEAN CULTURE  VAST KNOWLEDGE AND EXPERIENCE OF CARING FOR THOSE WITH DISABILITIES  AND LEARNING DISSABILITIES  ABILITY TO ASSIST WITH CLEANING/ COOKING TASKS  ASSIST WITH SHOPPING AND GOING OUT  HOURS: 2 PER WEEK INCREASING OVER THE COMING MONTHS  33 YEAR OLD DECENT YOUNG MAN WITH CEREBRAL PALSY AND LEARNING DIFFICULTIES, WHO HAS GIVEN UP ON LIFE. NEEDS ENCOURAGEMENT.  WE NEED A VERY DOWN TO EARTH AND CHILLED OUT RESOECTFUL PERSON WITH A GOOD WORK ETHIC.SOMEONE WHO WILL SLOWLY BUILD UP A STRONG RAPPORT WITH HARVEY.  OTHER MEMBERS OF THE FAMILY; MOTHER AND BROTHER  PLEASE SEND CV OR LETTER OF INTEREST STATING WHY YOU THINK YOU WOULD BE SUITABLE FOR THE ROLE.  THANKYOU",
  "Ad_id": "5412013821",
  "search_keywords": {
    "title": "Male Carer/Driver",
    "location": "Reading, Berkshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Baker/Manager",
  "location": "Bethnal Green, London",
  "Hours": "Full Time",
  "Job Level": "Management",
  "Posted": "4 days ago",
  "Salary": "£11.43 (plus 20% Share of business)",
  "Closes": "20 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "Baker/Manager (longterm)  We are opening small dessert shop in Cambridge Heath Road E2 9RA. This is rare opportunity for someone who has the skills of baking and running a business, We are giving away 20% share of the business without baring any costs that come with it and it comes with a salary. This is great for someone who is looking to open their own business but do not have the funds for it.  Job Description  Bake different desserts, create your own desserts Run business social media Great customer service Source ingredients/products keep all documents up to date and making payments i.e health certificates, bills etc  Please only apply if you have the right skills and able to take on important responsibilities.",
  "Ad_id": "5411986283",
  "search_keywords": {
    "title": "Baker/Manager",
    "location": "Bethnal Green, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Personal Assistant (PA) to Young Disabled Man",
  "location": "Gorgie, Edinburgh",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "9 days ago",
  "Salary": "£13.00 per hour",
  "Closes": "15 Jun 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "none": "none",
  "Description": "As a Personal Assistant (PA), your role is to enable the employer, a young disabled man and powerchair user, to be as independent as possible. This vacancy is only open to holders of a driving licence valid in the UK, unless working evening or night shift.  Key Responsibilities  Assist the employer with a wide range of social, work-related and domestic activities, including driving the employer’s Wheelchair Accessible Van (WAV). Assist the employer with cleaning, laundry, shopping and administrative tasks. Assist the employer with eating, drinking, preparing and cooking food. Assist the employer with dressing, showering and toileting, including use of a hoist. Assist the employer to be comfortable in bed overnight, repositioning him on request.  Skills & Personal Qualities  Enthusiastic, outgoing and positive attitude. Excellent communication and interpersonal skills. Excellent time-management and organisational skills. Previous experience supporting a disabled person and awareness of the Social Model of Disability is essential. Driving licence valid in the UK is essential. Protecting Vulnerable Groups (PVG) scheme membership is essential.  Additional Information  Opportunity is open to male and female applicants of all backgrounds. Employment is dependent upon the successful completion of paid trial period with training. Staff room available for taking rest breaks or supporting employer overnight.",
  "Ad_id": "5411945719",
  "search_keywords": {
    "title": "Personal Assistant (PA) to Young Disabled Man",
    "location": "Gorgie, Edinburgh"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Stoke-on-Trent, Staffordshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038192",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Stoke-on-Trent, Staffordshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "We are looking for an experienced ground worker / labourer who has experience in the building indust",
  "location": "Epsom, Surrey",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "21 hours ago",
  "Salary": "Negotiable",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Sub Contractor",
  "none": "none",
  "Description": "MUST BE EXPERIENCED IN THE BUILDING INDUSTRY AND HAVE TRANSPORT.  Groundworking and general labouring",
  "Ad_id": "5412032706",
  "search_keywords": {
    "title": "We are looking for an experienced ground worker / labourer who has experience in the building indust",
    "location": "Epsom, Surrey"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Experienced MINICAB CONTROLLERS / CO-ORDINATORS Required",
  "location": "West Ealing, London",
  "Hours": "Full Time",
  "Posted": "8 days ago",
  "Salary": "Up to £16 per hour",
  "Recruiter": "Angels Cars",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Direct Employer",
  "none": "none",
  "Description": "Come and join our excellent and rapidly growing team. We are a minicab and executive service based in London, which provides a large fleet of vehicles all over London and beyond. We are completing over 5 - 7000 jobs every week.  We are looking for EXPERIENCED, flexible, reliable, punctual, professional & customer-oriented CONTROLLERS / Coordinators & Dispatch.  We are a very well known minicab firm based in London, covering Greater London and the Surrounding Counties.  Controller / Coordinator & Dispatch Main Duties:  Ensuring that journeys are dispatched on time.  Liaising with Head Controller on a daily basis  Monitoring staff and improving call stats and drop call figures.  Dealing with customers & colleagues in a professional and courteous manner.  Requirements:  Over 1 years of experience ESSENTIAL  Be able to use AUTOCAB dispatching system  Speak excellent English & have a good telephone manner  Reliable  Punctual  Team player  Must have great knowledge of London  Best rates of pay in the industry  Our aim is to consistently deliver customer service excellence in the communities we provide services for. As an integral part of the community, we want to serve all with the best possible service. We have ambitious growth plans and require a great team of qualified individuals, who have a passion for excellent customer service.  We are close to overground, underground stations and main bus routes. Parking is available.  Please email us if you are interested in this position. We do not take recruitment phone calls.  Start dates are as soon as possible.",
  "Ad_id": "5411950908",
  "search_keywords": {
    "title": "Experienced MINICAB CONTROLLERS / CO-ORDINATORS Required",
    "location": "West Ealing, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Part Time Multi Drop Driver - Night Shift",
  "location": "Limehouse, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "2 days ago",
  "Salary": "12.00 per hour Mon and Wed",
  "Recruiter": "Jones Brothers",
  "Closes": "21 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Recruiter Type": "Direct Employer",
  "Description": "PART TIME Delivery Driver Role in London E14  If you are looking for a PART TIME delivery driving role on a long-term, permanent basis, with guaranteed hours and a consistent shift pattern each week, then please read on as this role could be for you.  We’re Jones Bros. A small, family run company based in London E14. We deliver Fresh Milk and Produce to customers throughout London and we are looking for a multi drop delivery rounds person to join our team on a PART TIME basis, working in the early hours of Monday morning and Wednesday morning of each week.  About the Job  We provide our customers with a top-class service, and as the face of our company, you will be doing the same, delivering fresh milk and other produce to our customers sites, whatever the weather, come rain or shine!  All you need is a Full UK Driving License and a positive, can-do attitude. Everything else within the role can be learned and taught.  You will be delivering to the same customers each week, so you will gain knowledge of your regular route and you will become familiar with the faces you meet along the way. This will include corporate offices, small businesses, and residential customers.  We will provide you with full training and support to ensure the role is a success.  We understand that you have a life outside of work, which is why we will offer you a permanent contract with guaranteed hours and a consistent shift pattern, ensuring you can plan ahead for any commitments you have outside of work.  So, if you are looking for a part time role on a long-term basis, with guaranteed hours and a consistent shift pattern, then this role may be for you.  Please be aware that this is a night-time position with a start time in the early hours of the morning. If you plan on using public transport, please check if you can travel to our site in E14 7BZ. Parking is available if you have your own transport.  Applications with a Cover Letter are preferred over applications without one and it would be beneficial if you could provide the reason you are specifically looking for part time role, as opposed to a full time role.  Salary: £12.00 p/hr  Hours: 15 per week  Shift Pattern: Monday and Wednesday (On a bank holiday Monday, the shift pattern will change to Tuesday and Wednesday, just for that week)  Start Time: Estimated 12am (Midnight)  Job Type: Part-time. Permanent.  Location: E14 7BZ",
  "Ad_id": "5411994913",
  "search_keywords": {
    "title": "Part Time Multi Drop Driver - Night Shift",
    "location": "Limehouse, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
  "location": "Leeds, West Yorkshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 hours ago",
  "Salary": "Varies between employers - Up to £1,150 per week with benefits",
  "Recruiter": "Live in Care Jobs Limited",
  "Closes": "24 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "LIVE-IN CARERS URGENTLY NEEDED to join the UK's premier Live in Care Jobs site for free!  Established in 2008 we are now the UK’s largest Job Board for Live-in Carers. Due to growth and an increasing pool of vacancies, we are currently looking for experienced Carers to register with us.  It is completely free for you to register and with over 700 leading employers and private recruiters currently working with us to find their talent, most experienced candidates are placed into a new role within just a few hours of applying!  What are the benefits of registering with us?  We are a true specialist within live-in care roles, you will find work relevant to you Very quick and easy registration process Ability to apply for jobs as well as be found by recruiters Most of our applicants find work immediately We have placements throughout the UK Salaries range up to £1,150 per week!  If you are an experienced Carer looking for your next role and are interested in live-in care, please register using the link below today.  We welcome all registrations from experienced and qualified applicants eligible to live and work in the UK.",
  "Ad_id": "5412038177",
  "search_keywords": {
    "title": "Live In Carers Needed - Register With Us - Immediate Starts - Up To £1,150 Per Week",
    "location": "Leeds, West Yorkshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "HGV 2 Commercial Tradewaste Driver",
  "location": "Central London, London",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 days ago",
  "Salary": "Negotiable",
  "Recruiter": "Corus Consultancy Ltd",
  "Closes": "29 May 2023",
  "Course": "No",
  "Contract Type": "Contract",
  "Recruiter Type": "Direct Employer",
  "Description": "We are currently looking for a HGV2 driver to work for a waste collecting company based in the SE1 area.  You will be going out in a dustcart lorry collecting waste from commercial properties. This is a driver loader position so manual work will be required. A loader may also be provided to help.  This is a Monday to Friday role and weekends are optional.  Hours of work: 3am - 11am or 3pm - 11pm  You must hold a HGV2 licence, CPC card and Tacho Card.  Newly passed drivers are happily accepted too.  If you are interested in this role and would like find out more please give Tracey a call.",
  "Ad_id": "5411993754",
  "search_keywords": {
    "title": "HGV 2 Commercial Tradewaste Driver",
    "location": "Central London, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "MOTOR MECHANIC / TECHNICIAN",
  "location": "Kelty, Fife",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "£37000 per annum + overtime",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "We are currently looking for a fully qualified motor mechanic/technician to join our team in a busy family run business. The successful candidate will be able to work using their own initiative and work well as part of a team.  This is a permanent full time position (overtime is available)  Duties will include  Carrying out servicing, repairs and maintenance to a high standard MOT Testing (if an approved tester) Inspecting vehicles to diagnose issues, use of diagnostic equipment Delivering a high level of customer satisfaction  Key Skills  Must be fully qualified Have ability to tackle all aspects of vehicle repair and maintenance Good attention to detail A proactive and enthusiastic approach A full driving licence",
  "Ad_id": "5412026731",
  "search_keywords": {
    "title": "MOTOR MECHANIC / TECHNICIAN",
    "location": "Kelty, Fife"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
  "location": "Bristol City Centre, Bristol",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "8 days ago",
  "Salary": "COMMISSION ONLY JOB",
  "Recruiter": "Avon - Julie Pearce",
  "Closes": "15 Jul 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "Recruiter Type": "Direct Employer",
  "Description": "AVON REPS WANTED  Work from home around your current commitments  Perfect for stay at home mums and dads, students or you in your spare time.  ** IMMEDIATE START **  Part time or Full time  No experience required  Very flexible, work around your family, studies, job etc when you want.  AVON REPRESENTATIVES  Share brochures with friends and family to get orders.  Use the digital brochure links to find customers online. Customers can shop online with you, and pay for their shopping online and Avon delivers the orders for you.  OR Deliver door-to-door to find more customers  Sell on eBay or Amazon and other selling sites if you want to earn more  MORE SALES = MORE EARNINGS  TEAM LEADERS are required throughout the UK.  Recruit and train a team of representatives, whilst earning commissions and bonuses on your team sales  Work from home around your existing commitments, Full or Part Time  Full training given for both positions  Must be 18  and living in the UK  COMMISSION ONLY JOB  APPLY NOW FOR MORE INFO",
  "Ad_id": "5411946336",
  "search_keywords": {
    "title": "AVON REPS NEEDED - IMMEDIATE START -ALL AREAS OF UK",
    "location": "Bristol City Centre, Bristol"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Dentist",
  "location": "Kirkintilloch, Glasgow",
  "Hours": "Part Time",
  "Job Level": "Graduate",
  "Posted": "1 day ago",
  "Salary": ".",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "none": "none",
  "Description": "Oak Tree Dental Kirkintilloch NHS/Private Dental Practice  Exciting Job Opportunity has arisen .We are looking for an associate Dentist to join our friendly experienced and supportive Dental team. Due to practice expanding we have a large NHS list with huge private potential.  At Oak Tree Dental Kirkintilloch we provide high quality care to NHS and Private Patients. Our team of dentists have wealth of experience in all aspects of dentistry, Welcoming both NHS and Private patients, we are looking for someone with a passion to provide a high level of care. We also have a busy Aesthetic clinic within a busy modern practice.  Also open for VTE Training.  To apply please email your cv to practice manager at oaktreedentalsignaturesmiles@gmail.com",
  "Ad_id": "5412002477",
  "search_keywords": {
    "title": "Dentist",
    "location": "Kirkintilloch, Glasgow"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "chef de partie",
  "location": "Shoreditch, London",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "2 days ago",
  "Salary": "Competitive pay",
  "Recruiter": "The English Restaurant/MarketCoffeeHouse&Bar",
  "Closes": "21 Jul 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "Description": "Chef de PARTIE, Shoreditch E1. We need your skills, creativity and enthusiasm! With scope for originality, that only a truly independent restaurant can offer, we are looking for someone to share our passion for fresh, seasonal and local produce.  As Chef de Partie, in our kitchen you will be part of a small team cooking from scratch with fresh produce from our excellent suppliers. There will be lots of opportunity for career progression for the right sort of person. Expect to be working 45-48 hours a week. Although we do have availability for a position with fewer hours, at an hourly rate.  We can offer a stable workplace, where your efforts will be appreciated, and excellent working conditions. The pay package on offer is attractive, based on a salary with a generous share of Tronc. Monthly pay, with no acceptions. Pay to be determined at interview, on the basis of experience.  Full eligibility to work in the UK is essential, as are strong communication and people skills. HACCP knowledge is a must. Real knowledge and a love of food would also be very welcome.",
  "Ad_id": "5411993114",
  "search_keywords": {
    "title": "chef de partie",
    "location": "Shoreditch, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Full time carer/companion - Elderly couple with health needs",
  "location": "Harpenden, Hertfordshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Competitive hourly rates",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Freelance",
  "none": "none",
  "Description": "I am looking for an experienced local carer to provide daily support to my mother and father who have lived together in Harpenden for 45 years. At this time, both of my parents are coping with ill health and mobility issues but are independent of mind and want to remain in their own home. They can however no longer do this without support and as such I am looking for someone kind, caring and experienced who can provide the support on either a live in or live out, part or full time basis. The role will include housekeeping, meal preparation, medication reminders, driving to and from medical and personal appointments and companionship. Support with dressing/washing may also be necessary depending on developments over the coming months. Ideally we would like someone with nursing qualifications / experience, as well as former roles working with a couple. Pay dependent on hours agreed and experience but very happy to discuss along with the role itself. We are keen to find someone asap so please do send a response if this sounds of interest and we will make contact. Many thanks.",
  "Ad_id": "5412027055",
  "search_keywords": {
    "title": "Full time carer/companion - Elderly couple with health needs",
    "location": "Harpenden, Hertfordshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "BRICKLAYERS REQUIRED",
  "location": "Chelmsford, Essex",
  "Hours": "Full Time",
  "Job Level": "Experienced",
  "Posted": "22 hours ago",
  "Salary": "WEEKLY PAID",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "IMMEDIATE START FOR EXPERIENCED BRICKLAYERS FOR A SITE IN LATCHINGDON = CM3 6LJ  MUST HOLD A CURRENT CSCS CARD  OWN TRANSPORT REQUIRED  CURRENT RATE OF £230.00 PER DAY  PLEASE CONTACT BEN ON 07738043737 OR THE OFFICE ON 01621857182",
  "Ad_id": "5412031427",
  "search_keywords": {
    "title": "BRICKLAYERS REQUIRED",
    "location": "Chelmsford, Essex"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Full time carer/companion - Elderly couple with health needs",
  "location": "Harpenden, Hertfordshire",
  "Language": "English",
  "Job Level": "Experienced",
  "Hours": "Full Time",
  "Posted": "1 day ago",
  "Salary": "Competitive hourly rates",
  "Closes": "23 Jun 2023",
  "Course": "No",
  "Contract Type": "Freelance",
  "none": "none",
  "Description": "I am looking for an experienced local carer to provide daily support to my mother and father who have lived together in Harpenden for 45 years. At this time, both of my parents are coping with ill health and mobility issues but are independent of mind and want to remain in their own home. They can however no longer do this without support and as such I am looking for someone kind, caring and experienced who can provide the support on either a live in or live out, part or full time basis. The role will include housekeeping, meal preparation, medication reminders, driving to and from medical and personal appointments and companionship. Support with dressing/washing may also be necessary depending on developments over the coming months. Ideally we would like someone with nursing qualifications / experience, as well as former roles working with a couple. Pay dependent on hours agreed and experience but very happy to discuss along with the role itself. We are keen to find someone asap so please do send a response if this sounds of interest and we will make contact. Many thanks.",
  "Ad_id": "5412027055",
  "search_keywords": {
    "title": "Full time carer/companion - Elderly couple with health needs",
    "location": "Harpenden, Hertfordshire"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "PART-TIME FEMALE PERSONAL CARE ASSISTANT(S) (PAs) wanted by private advertiser",
  "location": "Surbiton, London",
  "Language": "English",
  "Hours": "Part Time",
  "Posted": "10 days ago",
  "Salary": "£15.00 per hour",
  "Closes": "13 Jun 2023",
  "Course": "No",
  "Contract Type": "Permanent",
  "none": "none",
  "Description": "PART-TIME FEMALE PERSONAL CARE ASSISTANT(S) (PAs) WANTED by private advertiser (not agency or care home)  Permanent role(s). £15/hour (£16/hour before 9AM)  Tuesdays, 8AM-6PM (10 hours per week) Fridays, 8AM-4PM (8 hours per week)  Applicants may apply for either one day or both days.  Role:-  To support a disabled working age woman, in her home in Tolworth, Surbiton (KT6) and when she goes to work in London.  Duties include:-  personal care, keeping house, accompanying me when travelling to work, social events, etc. A detailed Job Description can be supplied upon request.  No experience necessary. Fully paid training will be given.  Essential requirements:-  You must live within easy travelling distance of Tolworth, Surbiton (KT6). (Only apply if you meet this requirement) You must be reliable & highly punctual Flexibility is essential You must be fit, strong & able to lift 32 kilos References will be required  Important:-  Female applicants only. This is permitted under Schedule 9, part 1 of the Equality Act 2010 as the role involves intimate care tasks.  Please apply by email to Jane Campbell: janecampbell@btinternet.com  To be considered, please provide your CV and mobile ‘phone number.  Please state if you are applying for Tuesday only, Friday only or both days.  Initial interviews will be by telephone.",
  "Ad_id": "5411935118",
  "search_keywords": {
    "title": "PART-TIME FEMALE PERSONAL CARE ASSISTANT(S) (PAs) wanted by private advertiser",
    "location": "Surbiton, London"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Part time cleaners required immediate start in Evesham,Pershore,Droitwich,and Worcester .£12 an hour",
  "location": "Birmingham, West Midlands",
  "Hours": "Part Time",
  "Posted": "6 days ago",
  "Salary": "12 an hour",
  "Recruiter": "NATIONWIDE CLEANERS GLOS WARWICK WORCESTERSHIRE LTD",
  "Closes": "18 Jul 2023",
  "Course": "No",
  "Contract Type": "Cash in Hand",
  "Recruiter Type": "Recruiter",
  "none": "none",
  "Description": "Cleaners are required for domestic cleaning work in Evesham, Pershore, Droitwich, Worcester,Bidford on Avon, Stratford upon Avon and surrounding areas  Reliable, punctual, and conscientious.  Drivers with the use of cars are ideal ..You must have a car unless you live locally  Part-time, Daytime-Weekdays  dusting and polishing furniture.  vacuuming/cleaning carpets.  mopping floor tiles.  Good interpersonal and communication skills",
  "Ad_id": "5411976401",
  "search_keywords": {
    "title": "Part time cleaners required immediate start in Evesham,Pershore,Droitwich,and Worcester .£12 an hour",
    "location": "Birmingham, West Midlands"
  }
},{
  "timestamp": "25/05/2023 18:35:00",
  "title": "Dentist",
  "location": "Kirkintilloch, Glasgow",
  "Hours": "Part Time",
  "Job Level": "Graduate",
  "Posted": "1 day ago",
  "Salary": ".",
  "Closes": "22 Jun 2023",
  "Course": "No",
  "Contract Type": "Self Employed",
  "none": "none",
  "Description": "Oak Tree Dental Kirkintilloch NHS/Private Dental Practice  Exciting Job Opportunity has arisen .We are looking for an associate Dentist to join our friendly experienced and supportive Dental team. Due to practice expanding we have a large NHS list with huge private potential.  At Oak Tree Dental Kirkintilloch we provide high quality care to NHS and Private Patients. Our team of dentists have wealth of experience in all aspects of dentistry, Welcoming both NHS and Private patients, we are looking for someone with a passion to provide a high level of care. We also have a busy Aesthetic clinic within a busy modern practice.  Also open for VTE Training.  To apply please email your cv to practice manager at oaktreedentalsignaturesmiles@gmail.com",
  "Ad_id": "5412002477",
  "search_keywords": {
    "title": "Dentist",
    "location": "Kirkintilloch, Glasgow"
  }
}]